MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1614/mcu.h
// Register: PID1SET
#define PID1SET PID1SET
extern volatile unsigned short          PID1SET             __at(0x58C);
#ifndef _LIB_BUILD
asm("PID1SET equ 058Ch");
#endif

// Register: PID1SETL
#define PID1SETL PID1SETL
extern volatile unsigned char           PID1SETL            __at(0x58C);
#ifndef _LIB_BUILD
asm("PID1SETL equ 058Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID1SET0               :1;
        unsigned PID1SET1               :1;
        unsigned PID1SET2               :1;
        unsigned PID1SET3               :1;
        unsigned PID1SET4               :1;
        unsigned PID1SET5               :1;
        unsigned PID1SET6               :1;
        unsigned PID1SET7               :1;
    };
    struct {
        unsigned SET0                   :1;
        unsigned SET1                   :1;
        unsigned SET2                   :1;
        unsigned SET3                   :1;
        unsigned SET4                   :1;
        unsigned SET5                   :1;
        unsigned SET6                   :1;
        unsigned SET7                   :1;
    };
} PID1SETLbits_t;
extern volatile PID1SETLbits_t PID1SETLbits __at(0x58C);
// bitfield macros
#define _PID1SETL_PID1SET0_POSN                             0x0
#define _PID1SETL_PID1SET0_POSITION                         0x0
#define _PID1SETL_PID1SET0_SIZE                             0x1
#define _PID1SETL_PID1SET0_LENGTH                           0x1
#define _PID1SETL_PID1SET0_MASK                             0x1
#define _PID1SETL_PID1SET1_POSN                             0x1
#define _PID1SETL_PID1SET1_POSITION                         0x1
#define _PID1SETL_PID1SET1_SIZE                             0x1
#define _PID1SETL_PID1SET1_LENGTH                           0x1
#define _PID1SETL_PID1SET1_MASK                             0x2
#define _PID1SETL_PID1SET2_POSN                             0x2
#define _PID1SETL_PID1SET2_POSITION                         0x2
#define _PID1SETL_PID1SET2_SIZE                             0x1
#define _PID1SETL_PID1SET2_LENGTH                           0x1
#define _PID1SETL_PID1SET2_MASK                             0x4
#define _PID1SETL_PID1SET3_POSN                             0x3
#define _PID1SETL_PID1SET3_POSITION                         0x3
#define _PID1SETL_PID1SET3_SIZE                             0x1
#define _PID1SETL_PID1SET3_LENGTH                           0x1
#define _PID1SETL_PID1SET3_MASK                             0x8
#define _PID1SETL_PID1SET4_POSN                             0x4
#define _PID1SETL_PID1SET4_POSITION                         0x4
#define _PID1SETL_PID1SET4_SIZE                             0x1
#define _PID1SETL_PID1SET4_LENGTH                           0x1
#define _PID1SETL_PID1SET4_MASK                             0x10
#define _PID1SETL_PID1SET5_POSN                             0x5
#define _PID1SETL_PID1SET5_POSITION                         0x5
#define _PID1SETL_PID1SET5_SIZE                             0x1
#define _PID1SETL_PID1SET5_LENGTH                           0x1
#define _PID1SETL_PID1SET5_MASK                             0x20
#define _PID1SETL_PID1SET6_POSN                             0x6
#define _PID1SETL_PID1SET6_POSITION                         0x6
#define _PID1SETL_PID1SET6_SIZE                             0x1
#define _PID1SETL_PID1SET6_LENGTH                           0x1
#define _PID1SETL_PID1SET6_MASK                             0x40
#define _PID1SETL_PID1SET7_POSN                             0x7
#define _PID1SETL_PID1SET7_POSITION                         0x7
#define _PID1SETL_PID1SET7_SIZE                             0x1
#define _PID1SETL_PID1SET7_LENGTH                           0x1
#define _PID1SETL_PID1SET7_MASK                             0x80
#define _PID1SETL_SET0_POSN                                 0x0
#define _PID1SETL_SET0_POSITION                             0x0
#define _PID1SETL_SET0_SIZE                                 0x1
#define _PID1SETL_SET0_LENGTH                               0x1
#define _PID1SETL_SET0_MASK                                 0x1
#define _PID1SETL_SET1_POSN                                 0x1
#define _PID1SETL_SET1_POSITION                             0x1
#define _PID1SETL_SET1_SIZE                                 0x1
#define _PID1SETL_SET1_LENGTH                               0x1
#define _PID1SETL_SET1_MASK                                 0x2
#define _PID1SETL_SET2_POSN                                 0x2
#define _PID1SETL_SET2_POSITION                             0x2
#define _PID1SETL_SET2_SIZE                                 0x1
#define _PID1SETL_SET2_LENGTH                               0x1
#define _PID1SETL_SET2_MASK                                 0x4
#define _PID1SETL_SET3_POSN                                 0x3
#define _PID1SETL_SET3_POSITION                             0x3
#define _PID1SETL_SET3_SIZE                                 0x1
#define _PID1SETL_SET3_LENGTH                               0x1
#define _PID1SETL_SET3_MASK                                 0x8
#define _PID1SETL_SET4_POSN                                 0x4
#define _PID1SETL_SET4_POSITION                             0x4
#define _PID1SETL_SET4_SIZE                                 0x1
#define _PID1SETL_SET4_LENGTH                               0x1
#define _PID1SETL_SET4_MASK                                 0x10
#define _PID1SETL_SET5_POSN                                 0x5
#define _PID1SETL_SET5_POSITION                             0x5
#define _PID1SETL_SET5_SIZE                                 0x1
#define _PID1SETL_SET5_LENGTH                               0x1
#define _PID1SETL_SET5_MASK                                 0x20
#define _PID1SETL_SET6_POSN                                 0x6
#define _PID1SETL_SET6_POSITION                             0x6
#define _PID1SETL_SET6_SIZE                                 0x1
#define _PID1SETL_SET6_LENGTH                               0x1
#define _PID1SETL_SET6_MASK                                 0x40
#define _PID1SETL_SET7_POSN                                 0x7
#define _PID1SETL_SET7_POSITION                             0x7
#define _PID1SETL_SET7_SIZE                                 0x1
#define _PID1SETL_SET7_LENGTH                               0x1
#define _PID1SETL_SET7_MASK                                 0x80

// Register: PID1SETH
#define PID1SETH PID1SETH
extern volatile unsigned char           PID1SETH            __at(0x58D);
#ifndef _LIB_BUILD
asm("PID1SETH equ 058Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID1SET8               :1;
        unsigned PID1SET9               :1;
        unsigned PID1SET10              :1;
        unsigned PID1SET11              :1;
        unsigned PID1SET12              :1;
        unsigned PID1SET13              :1;
        unsigned PID1SET14              :1;
        unsigned PID1SET15              :1;
    };
    struct {
        unsigned SET8                   :1;
        unsigned SET9                   :1;
        unsigned SET10                  :1;
        unsigned SET11                  :1;
        unsigned SET12                  :1;
        unsigned SET13                  :1;
        unsigned SET14                  :1;
        unsigned SET15                  :1;
    };
} PID1SETHbits_t;
extern volatile PID1SETHbits_t PID1SETHbits __at(0x58D);
// bitfield macros
#define _PID1SETH_PID1SET8_POSN                             0x0
#define _PID1SETH_PID1SET8_POSITION                         0x0
#define _PID1SETH_PID1SET8_SIZE                             0x1
#define _PID1SETH_PID1SET8_LENGTH                           0x1
#define _PID1SETH_PID1SET8_MASK                             0x1
#define _PID1SETH_PID1SET9_POSN                             0x1
#define _PID1SETH_PID1SET9_POSITION                         0x1
#define _PID1SETH_PID1SET9_SIZE                             0x1
#define _PID1SETH_PID1SET9_LENGTH                           0x1
#define _PID1SETH_PID1SET9_MASK                             0x2
#define _PID1SETH_PID1SET10_POSN                            0x2
#define _PID1SETH_PID1SET10_POSITION                        0x2
#define _PID1SETH_PID1SET10_SIZE                            0x1
#define _PID1SETH_PID1SET10_LENGTH                          0x1
#define _PID1SETH_PID1SET10_MASK                            0x4
#define _PID1SETH_PID1SET11_POSN                            0x3
#define _PID1SETH_PID1SET11_POSITION                        0x3
#define _PID1SETH_PID1SET11_SIZE                            0x1
#define _PID1SETH_PID1SET11_LENGTH                          0x1
#define _PID1SETH_PID1SET11_MASK                            0x8
#define _PID1SETH_PID1SET12_POSN                            0x4
#define _PID1SETH_PID1SET12_POSITION                        0x4
#define _PID1SETH_PID1SET12_SIZE                            0x1
#define _PID1SETH_PID1SET12_LENGTH                          0x1
#define _PID1SETH_PID1SET12_MASK                            0x10
#define _PID1SETH_PID1SET13_POSN                            0x5
#define _PID1SETH_PID1SET13_POSITION                        0x5
#define _PID1SETH_PID1SET13_SIZE                            0x1
#define _PID1SETH_PID1SET13_LENGTH                          0x1
#define _PID1SETH_PID1SET13_MASK                            0x20
#define _PID1SETH_PID1SET14_POSN                            0x6
#define _PID1SETH_PID1SET14_POSITION                        0x6
#define _PID1SETH_PID1SET14_SIZE                            0x1
#define _PID1SETH_PID1SET14_LENGTH                          0x1
#define _PID1SETH_PID1SET14_MASK                            0x40
#define _PID1SETH_PID1SET15_POSN                            0x7
#define _PID1SETH_PID1SET15_POSITION                        0x7
#define _PID1SETH_PID1SET15_SIZE                            0x1
#define _PID1SETH_PID1SET15_LENGTH                          0x1
#define _PID1SETH_PID1SET15_MASK                            0x80
#define _PID1SETH_SET8_POSN                                 0x0
#define _PID1SETH_SET8_POSITION                             0x0
#define _PID1SETH_SET8_SIZE                                 0x1
#define _PID1SETH_SET8_LENGTH                               0x1
#define _PID1SETH_SET8_MASK                                 0x1
#define _PID1SETH_SET9_POSN                                 0x1
#define _PID1SETH_SET9_POSITION                             0x1
#define _PID1SETH_SET9_SIZE                                 0x1
#define _PID1SETH_SET9_LENGTH                               0x1
#define _PID1SETH_SET9_MASK                                 0x2
#define _PID1SETH_SET10_POSN                                0x2
#define _PID1SETH_SET10_POSITION                            0x2
#define _PID1SETH_SET10_SIZE                                0x1
#define _PID1SETH_SET10_LENGTH                              0x1
#define _PID1SETH_SET10_MASK                                0x4
#define _PID1SETH_SET11_POSN                                0x3
#define _PID1SETH_SET11_POSITION                            0x3
#define _PID1SETH_SET11_SIZE                                0x1
#define _PID1SETH_SET11_LENGTH                              0x1
#define _PID1SETH_SET11_MASK                                0x8
#define _PID1SETH_SET12_POSN                                0x4
#define _PID1SETH_SET12_POSITION                            0x4
#define _PID1SETH_SET12_SIZE                                0x1
#define _PID1SETH_SET12_LENGTH                              0x1
#define _PID1SETH_SET12_MASK                                0x10
#define _PID1SETH_SET13_POSN                                0x5
#define _PID1SETH_SET13_POSITION                            0x5
#define _PID1SETH_SET13_SIZE                                0x1
#define _PID1SETH_SET13_LENGTH                              0x1
#define _PID1SETH_SET13_MASK                                0x20
#define _PID1SETH_SET14_POSN                                0x6
#define _PID1SETH_SET14_POSITION                            0x6
#define _PID1SETH_SET14_SIZE                                0x1
#define _PID1SETH_SET14_LENGTH                              0x1
#define _PID1SETH_SET14_MASK                                0x40
#define _PID1SETH_SET15_POSN                                0x7
#define _PID1SETH_SET15_POSITION                            0x7
#define _PID1SETH_SET15_SIZE                                0x1
#define _PID1SETH_SET15_LENGTH                              0x1
#define _PID1SETH_SET15_MASK                                0x80

// Register: PID1IN
#define PID1IN PID1IN
extern volatile unsigned short          PID1IN              __at(0x58E);
#ifndef _LIB_BUILD
asm("PID1IN equ 058Eh");
#endif

// Register: PID1INL
#define PID1INL PID1INL
extern volatile unsigned char           PID1INL             __at(0x58E);
#ifndef _LIB_BUILD
asm("PID1INL equ 058Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID1IN0                :1;
        unsigned PID1IN1                :1;
        unsigned PID1IN2                :1;
        unsigned PID1IN3                :1;
        unsigned PID1IN4                :1;
        unsigned PID1IN5                :1;
        unsigned PID1IN6                :1;
        unsigned PID1IN7                :1;
    };
    struct {
        unsigned IN0                    :1;
        unsigned IN1                    :1;
        unsigned IN2                    :1;
        unsigned IN3                    :1;
        unsigned IN4                    :1;
        unsigned IN5                    :1;
        unsigned IN6                    :1;
        unsigned IN7                    :1;
    };
} PID1INLbits_t;
extern volatile PID1INLbits_t PID1INLbits __at(0x58E);
// bitfield macros
#define _PID1INL_PID1IN0_POSN                               0x0
#define _PID1INL_PID1IN0_POSITION                           0x0
#define _PID1INL_PID1IN0_SIZE                               0x1
#define _PID1INL_PID1IN0_LENGTH                             0x1
#define _PID1INL_PID1IN0_MASK                               0x1
#define _PID1INL_PID1IN1_POSN                               0x1
#define _PID1INL_PID1IN1_POSITION                           0x1
#define _PID1INL_PID1IN1_SIZE                               0x1
#define _PID1INL_PID1IN1_LENGTH                             0x1
#define _PID1INL_PID1IN1_MASK                               0x2
#define _PID1INL_PID1IN2_POSN                               0x2
#define _PID1INL_PID1IN2_POSITION                           0x2
#define _PID1INL_PID1IN2_SIZE                               0x1
#define _PID1INL_PID1IN2_LENGTH                             0x1
#define _PID1INL_PID1IN2_MASK                               0x4
#define _PID1INL_PID1IN3_POSN                               0x3
#define _PID1INL_PID1IN3_POSITION                           0x3
#define _PID1INL_PID1IN3_SIZE                               0x1
#define _PID1INL_PID1IN3_LENGTH                             0x1
#define _PID1INL_PID1IN3_MASK                               0x8
#define _PID1INL_PID1IN4_POSN                               0x4
#define _PID1INL_PID1IN4_POSITION                           0x4
#define _PID1INL_PID1IN4_SIZE                               0x1
#define _PID1INL_PID1IN4_LENGTH                             0x1
#define _PID1INL_PID1IN4_MASK                               0x10
#define _PID1INL_PID1IN5_POSN                               0x5
#define _PID1INL_PID1IN5_POSITION                           0x5
#define _PID1INL_PID1IN5_SIZE                               0x1
#define _PID1INL_PID1IN5_LENGTH                             0x1
#define _PID1INL_PID1IN5_MASK                               0x20
#define _PID1INL_PID1IN6_POSN                               0x6
#define _PID1INL_PID1IN6_POSITION                           0x6
#define _PID1INL_PID1IN6_SIZE                               0x1
#define _PID1INL_PID1IN6_LENGTH                             0x1
#define _PID1INL_PID1IN6_MASK                               0x40
#define _PID1INL_PID1IN7_POSN                               0x7
#define _PID1INL_PID1IN7_POSITION                           0x7
#define _PID1INL_PID1IN7_SIZE                               0x1
#define _PID1INL_PID1IN7_LENGTH                             0x1
#define _PID1INL_PID1IN7_MASK                               0x80
#define _PID1INL_IN0_POSN                                   0x0
#define _PID1INL_IN0_POSITION                               0x0
#define _PID1INL_IN0_SIZE                                   0x1
#define _PID1INL_IN0_LENGTH                                 0x1
#define _PID1INL_IN0_MASK                                   0x1
#define _PID1INL_IN1_POSN                                   0x1
#define _PID1INL_IN1_POSITION                               0x1
#define _PID1INL_IN1_SIZE                                   0x1
#define _PID1INL_IN1_LENGTH                                 0x1
#define _PID1INL_IN1_MASK                                   0x2
#define _PID1INL_IN2_POSN                                   0x2
#define _PID1INL_IN2_POSITION                               0x2
#define _PID1INL_IN2_SIZE                                   0x1
#define _PID1INL_IN2_LENGTH                                 0x1
#define _PID1INL_IN2_MASK                                   0x4
#define _PID1INL_IN3_POSN                                   0x3
#define _PID1INL_IN3_POSITION                               0x3
#define _PID1INL_IN3_SIZE                                   0x1
#define _PID1INL_IN3_LENGTH                                 0x1
#define _PID1INL_IN3_MASK                                   0x8
#define _PID1INL_IN4_POSN                                   0x4
#define _PID1INL_IN4_POSITION                               0x4
#define _PID1INL_IN4_SIZE                                   0x1
#define _PID1INL_IN4_LENGTH                                 0x1
#define _PID1INL_IN4_MASK                                   0x10
#define _PID1INL_IN5_POSN                                   0x5
#define _PID1INL_IN5_POSITION                               0x5
#define _PID1INL_IN5_SIZE                                   0x1
#define _PID1INL_IN5_LENGTH                                 0x1
#define _PID1INL_IN5_MASK                                   0x20
#define _PID1INL_IN6_POSN                                   0x6
#define _PID1INL_IN6_POSITION                               0x6
#define _PID1INL_IN6_SIZE                                   0x1
#define _PID1INL_IN6_LENGTH                                 0x1
#define _PID1INL_IN6_MASK                                   0x40
#define _PID1INL_IN7_POSN                                   0x7
#define _PID1INL_IN7_POSITION                               0x7
#define _PID1INL_IN7_SIZE                                   0x1
#define _PID1INL_IN7_LENGTH                                 0x1
#define _PID1INL_IN7_MASK                                   0x80

// Register: PID1INH
#define PID1INH PID1INH
extern volatile unsigned char           PID1INH             __at(0x58F);
#ifndef _LIB_BUILD
asm("PID1INH equ 058Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID1IN8                :1;
        unsigned PID1IN9                :1;
        unsigned PID1IN10               :1;
        unsigned PID1IN11               :1;
        unsigned PID1IN12               :1;
        unsigned PID1IN13               :1;
        unsigned PID1IN14               :1;
        unsigned PID1IN15               :1;
    };
    struct {
        unsigned IN8                    :1;
        unsigned IN9                    :1;
        unsigned IN10                   :1;
        unsigned IN11                   :1;
        unsigned IN12                   :1;
        unsigned IN13                   :1;
        unsigned IN14                   :1;
        unsigned IN15                   :1;
    };
} PID1INHbits_t;
