MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1614/mcu.h
extern volatile PID1INHbits_t PID1INHbits __at(0x58F);
// bitfield macros
#define _PID1INH_PID1IN8_POSN                               0x0
#define _PID1INH_PID1IN8_POSITION                           0x0
#define _PID1INH_PID1IN8_SIZE                               0x1
#define _PID1INH_PID1IN8_LENGTH                             0x1
#define _PID1INH_PID1IN8_MASK                               0x1
#define _PID1INH_PID1IN9_POSN                               0x1
#define _PID1INH_PID1IN9_POSITION                           0x1
#define _PID1INH_PID1IN9_SIZE                               0x1
#define _PID1INH_PID1IN9_LENGTH                             0x1
#define _PID1INH_PID1IN9_MASK                               0x2
#define _PID1INH_PID1IN10_POSN                              0x2
#define _PID1INH_PID1IN10_POSITION                          0x2
#define _PID1INH_PID1IN10_SIZE                              0x1
#define _PID1INH_PID1IN10_LENGTH                            0x1
#define _PID1INH_PID1IN10_MASK                              0x4
#define _PID1INH_PID1IN11_POSN                              0x3
#define _PID1INH_PID1IN11_POSITION                          0x3
#define _PID1INH_PID1IN11_SIZE                              0x1
#define _PID1INH_PID1IN11_LENGTH                            0x1
#define _PID1INH_PID1IN11_MASK                              0x8
#define _PID1INH_PID1IN12_POSN                              0x4
#define _PID1INH_PID1IN12_POSITION                          0x4
#define _PID1INH_PID1IN12_SIZE                              0x1
#define _PID1INH_PID1IN12_LENGTH                            0x1
#define _PID1INH_PID1IN12_MASK                              0x10
#define _PID1INH_PID1IN13_POSN                              0x5
#define _PID1INH_PID1IN13_POSITION                          0x5
#define _PID1INH_PID1IN13_SIZE                              0x1
#define _PID1INH_PID1IN13_LENGTH                            0x1
#define _PID1INH_PID1IN13_MASK                              0x20
#define _PID1INH_PID1IN14_POSN                              0x6
#define _PID1INH_PID1IN14_POSITION                          0x6
#define _PID1INH_PID1IN14_SIZE                              0x1
#define _PID1INH_PID1IN14_LENGTH                            0x1
#define _PID1INH_PID1IN14_MASK                              0x40
#define _PID1INH_PID1IN15_POSN                              0x7
#define _PID1INH_PID1IN15_POSITION                          0x7
#define _PID1INH_PID1IN15_SIZE                              0x1
#define _PID1INH_PID1IN15_LENGTH                            0x1
#define _PID1INH_PID1IN15_MASK                              0x80
#define _PID1INH_IN8_POSN                                   0x0
#define _PID1INH_IN8_POSITION                               0x0
#define _PID1INH_IN8_SIZE                                   0x1
#define _PID1INH_IN8_LENGTH                                 0x1
#define _PID1INH_IN8_MASK                                   0x1
#define _PID1INH_IN9_POSN                                   0x1
#define _PID1INH_IN9_POSITION                               0x1
#define _PID1INH_IN9_SIZE                                   0x1
#define _PID1INH_IN9_LENGTH                                 0x1
#define _PID1INH_IN9_MASK                                   0x2
#define _PID1INH_IN10_POSN                                  0x2
#define _PID1INH_IN10_POSITION                              0x2
#define _PID1INH_IN10_SIZE                                  0x1
#define _PID1INH_IN10_LENGTH                                0x1
#define _PID1INH_IN10_MASK                                  0x4
#define _PID1INH_IN11_POSN                                  0x3
#define _PID1INH_IN11_POSITION                              0x3
#define _PID1INH_IN11_SIZE                                  0x1
#define _PID1INH_IN11_LENGTH                                0x1
#define _PID1INH_IN11_MASK                                  0x8
#define _PID1INH_IN12_POSN                                  0x4
#define _PID1INH_IN12_POSITION                              0x4
#define _PID1INH_IN12_SIZE                                  0x1
#define _PID1INH_IN12_LENGTH                                0x1
#define _PID1INH_IN12_MASK                                  0x10
#define _PID1INH_IN13_POSN                                  0x5
#define _PID1INH_IN13_POSITION                              0x5
#define _PID1INH_IN13_SIZE                                  0x1
#define _PID1INH_IN13_LENGTH                                0x1
#define _PID1INH_IN13_MASK                                  0x20
#define _PID1INH_IN14_POSN                                  0x6
#define _PID1INH_IN14_POSITION                              0x6
#define _PID1INH_IN14_SIZE                                  0x1
#define _PID1INH_IN14_LENGTH                                0x1
#define _PID1INH_IN14_MASK                                  0x40
#define _PID1INH_IN15_POSN                                  0x7
#define _PID1INH_IN15_POSITION                              0x7
#define _PID1INH_IN15_SIZE                                  0x1
#define _PID1INH_IN15_LENGTH                                0x1
#define _PID1INH_IN15_MASK                                  0x80

// Register: PID1K1
#define PID1K1 PID1K1
extern volatile unsigned short          PID1K1              __at(0x590);
#ifndef _LIB_BUILD
asm("PID1K1 equ 0590h");
#endif

// Register: PID1K1L
#define PID1K1L PID1K1L
extern volatile unsigned char           PID1K1L             __at(0x590);
#ifndef _LIB_BUILD
asm("PID1K1L equ 0590h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID1K10                :1;
        unsigned PID1K11                :1;
        unsigned PID1K12                :1;
        unsigned PID1K13                :1;
        unsigned PID1K14                :1;
        unsigned PID1K15                :1;
        unsigned PID1K16                :1;
        unsigned PID1K17                :1;
    };
    struct {
        unsigned K10                    :1;
        unsigned K11                    :1;
        unsigned K12                    :1;
        unsigned K13                    :1;
        unsigned K14                    :1;
        unsigned K15                    :1;
        unsigned K16                    :1;
        unsigned K17                    :1;
    };
} PID1K1Lbits_t;
