MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1614/mcu.h
// Register: PID1K2
#define PID1K2 PID1K2
extern volatile unsigned short          PID1K2              __at(0x592);
#ifndef _LIB_BUILD
asm("PID1K2 equ 0592h");
#endif

// Register: PID1K2L
#define PID1K2L PID1K2L
extern volatile unsigned char           PID1K2L             __at(0x592);
#ifndef _LIB_BUILD
asm("PID1K2L equ 0592h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID1K20                :1;
        unsigned PID1K21                :1;
        unsigned PID1K22                :1;
        unsigned PID1K23                :1;
        unsigned PID1K24                :1;
        unsigned PID1K25                :1;
        unsigned PID1K26                :1;
        unsigned PID1K27                :1;
    };
    struct {
        unsigned K20                    :1;
        unsigned K21                    :1;
        unsigned K22                    :1;
        unsigned K23                    :1;
        unsigned K24                    :1;
        unsigned K25                    :1;
        unsigned K26                    :1;
        unsigned K27                    :1;
    };
} PID1K2Lbits_t;
extern volatile PID1K2Lbits_t PID1K2Lbits __at(0x592);
// bitfield macros
#define _PID1K2L_PID1K20_POSN                               0x0
#define _PID1K2L_PID1K20_POSITION                           0x0
#define _PID1K2L_PID1K20_SIZE                               0x1
#define _PID1K2L_PID1K20_LENGTH                             0x1
#define _PID1K2L_PID1K20_MASK                               0x1
#define _PID1K2L_PID1K21_POSN                               0x1
#define _PID1K2L_PID1K21_POSITION                           0x1
#define _PID1K2L_PID1K21_SIZE                               0x1
#define _PID1K2L_PID1K21_LENGTH                             0x1
#define _PID1K2L_PID1K21_MASK                               0x2
#define _PID1K2L_PID1K22_POSN                               0x2
#define _PID1K2L_PID1K22_POSITION                           0x2
#define _PID1K2L_PID1K22_SIZE                               0x1
#define _PID1K2L_PID1K22_LENGTH                             0x1
#define _PID1K2L_PID1K22_MASK                               0x4
#define _PID1K2L_PID1K23_POSN                               0x3
#define _PID1K2L_PID1K23_POSITION                           0x3
#define _PID1K2L_PID1K23_SIZE                               0x1
#define _PID1K2L_PID1K23_LENGTH                             0x1
#define _PID1K2L_PID1K23_MASK                               0x8
#define _PID1K2L_PID1K24_POSN                               0x4
#define _PID1K2L_PID1K24_POSITION                           0x4
#define _PID1K2L_PID1K24_SIZE                               0x1
#define _PID1K2L_PID1K24_LENGTH                             0x1
#define _PID1K2L_PID1K24_MASK                               0x10
#define _PID1K2L_PID1K25_POSN                               0x5
#define _PID1K2L_PID1K25_POSITION                           0x5
#define _PID1K2L_PID1K25_SIZE                               0x1
#define _PID1K2L_PID1K25_LENGTH                             0x1
#define _PID1K2L_PID1K25_MASK                               0x20
#define _PID1K2L_PID1K26_POSN                               0x6
#define _PID1K2L_PID1K26_POSITION                           0x6
#define _PID1K2L_PID1K26_SIZE                               0x1
#define _PID1K2L_PID1K26_LENGTH                             0x1
#define _PID1K2L_PID1K26_MASK                               0x40
#define _PID1K2L_PID1K27_POSN                               0x7
#define _PID1K2L_PID1K27_POSITION                           0x7
#define _PID1K2L_PID1K27_SIZE                               0x1
#define _PID1K2L_PID1K27_LENGTH                             0x1
#define _PID1K2L_PID1K27_MASK                               0x80
#define _PID1K2L_K20_POSN                                   0x0
#define _PID1K2L_K20_POSITION                               0x0
#define _PID1K2L_K20_SIZE                                   0x1
#define _PID1K2L_K20_LENGTH                                 0x1
#define _PID1K2L_K20_MASK                                   0x1
#define _PID1K2L_K21_POSN                                   0x1
#define _PID1K2L_K21_POSITION                               0x1
#define _PID1K2L_K21_SIZE                                   0x1
#define _PID1K2L_K21_LENGTH                                 0x1
#define _PID1K2L_K21_MASK                                   0x2
#define _PID1K2L_K22_POSN                                   0x2
#define _PID1K2L_K22_POSITION                               0x2
#define _PID1K2L_K22_SIZE                                   0x1
#define _PID1K2L_K22_LENGTH                                 0x1
#define _PID1K2L_K22_MASK                                   0x4
#define _PID1K2L_K23_POSN                                   0x3
#define _PID1K2L_K23_POSITION                               0x3
#define _PID1K2L_K23_SIZE                                   0x1
#define _PID1K2L_K23_LENGTH                                 0x1
#define _PID1K2L_K23_MASK                                   0x8
#define _PID1K2L_K24_POSN                                   0x4
#define _PID1K2L_K24_POSITION                               0x4
#define _PID1K2L_K24_SIZE                                   0x1
#define _PID1K2L_K24_LENGTH                                 0x1
#define _PID1K2L_K24_MASK                                   0x10
#define _PID1K2L_K25_POSN                                   0x5
#define _PID1K2L_K25_POSITION                               0x5
#define _PID1K2L_K25_SIZE                                   0x1
#define _PID1K2L_K25_LENGTH                                 0x1
#define _PID1K2L_K25_MASK                                   0x20
#define _PID1K2L_K26_POSN                                   0x6
#define _PID1K2L_K26_POSITION                               0x6
#define _PID1K2L_K26_SIZE                                   0x1
#define _PID1K2L_K26_LENGTH                                 0x1
#define _PID1K2L_K26_MASK                                   0x40
#define _PID1K2L_K27_POSN                                   0x7
#define _PID1K2L_K27_POSITION                               0x7
#define _PID1K2L_K27_SIZE                                   0x1
#define _PID1K2L_K27_LENGTH                                 0x1
#define _PID1K2L_K27_MASK                                   0x80

// Register: PID1K2H
#define PID1K2H PID1K2H
extern volatile unsigned char           PID1K2H             __at(0x593);
#ifndef _LIB_BUILD
asm("PID1K2H equ 0593h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID1K28                :1;
        unsigned PID1K29                :1;
        unsigned PID1K210               :1;
        unsigned PID1K211               :1;
        unsigned PID1K212               :1;
        unsigned PID1K213               :1;
        unsigned PID1K214               :1;
        unsigned PID1K215               :1;
    };
    struct {
        unsigned K28                    :1;
        unsigned K29                    :1;
        unsigned K210                   :1;
        unsigned K211                   :1;
        unsigned K212                   :1;
        unsigned K213                   :1;
        unsigned K214                   :1;
        unsigned K215                   :1;
    };
} PID1K2Hbits_t;
extern volatile PID1K2Hbits_t PID1K2Hbits __at(0x593);
// bitfield macros
#define _PID1K2H_PID1K28_POSN                               0x0
#define _PID1K2H_PID1K28_POSITION                           0x0
#define _PID1K2H_PID1K28_SIZE                               0x1
#define _PID1K2H_PID1K28_LENGTH                             0x1
#define _PID1K2H_PID1K28_MASK                               0x1
#define _PID1K2H_PID1K29_POSN                               0x1
#define _PID1K2H_PID1K29_POSITION                           0x1
#define _PID1K2H_PID1K29_SIZE                               0x1
#define _PID1K2H_PID1K29_LENGTH                             0x1
#define _PID1K2H_PID1K29_MASK                               0x2
#define _PID1K2H_PID1K210_POSN                              0x2
#define _PID1K2H_PID1K210_POSITION                          0x2
#define _PID1K2H_PID1K210_SIZE                              0x1
#define _PID1K2H_PID1K210_LENGTH                            0x1
#define _PID1K2H_PID1K210_MASK                              0x4
#define _PID1K2H_PID1K211_POSN                              0x3
#define _PID1K2H_PID1K211_POSITION                          0x3
#define _PID1K2H_PID1K211_SIZE                              0x1
#define _PID1K2H_PID1K211_LENGTH                            0x1
#define _PID1K2H_PID1K211_MASK                              0x8
#define _PID1K2H_PID1K212_POSN                              0x4
#define _PID1K2H_PID1K212_POSITION                          0x4
#define _PID1K2H_PID1K212_SIZE                              0x1
#define _PID1K2H_PID1K212_LENGTH                            0x1
#define _PID1K2H_PID1K212_MASK                              0x10
#define _PID1K2H_PID1K213_POSN                              0x5
#define _PID1K2H_PID1K213_POSITION                          0x5
#define _PID1K2H_PID1K213_SIZE                              0x1
#define _PID1K2H_PID1K213_LENGTH                            0x1
#define _PID1K2H_PID1K213_MASK                              0x20
#define _PID1K2H_PID1K214_POSN                              0x6
#define _PID1K2H_PID1K214_POSITION                          0x6
#define _PID1K2H_PID1K214_SIZE                              0x1
#define _PID1K2H_PID1K214_LENGTH                            0x1
#define _PID1K2H_PID1K214_MASK                              0x40
#define _PID1K2H_PID1K215_POSN                              0x7
#define _PID1K2H_PID1K215_POSITION                          0x7
#define _PID1K2H_PID1K215_SIZE                              0x1
#define _PID1K2H_PID1K215_LENGTH                            0x1
#define _PID1K2H_PID1K215_MASK                              0x80
#define _PID1K2H_K28_POSN                                   0x0
#define _PID1K2H_K28_POSITION                               0x0
#define _PID1K2H_K28_SIZE                                   0x1
#define _PID1K2H_K28_LENGTH                                 0x1
#define _PID1K2H_K28_MASK                                   0x1
#define _PID1K2H_K29_POSN                                   0x1
#define _PID1K2H_K29_POSITION                               0x1
#define _PID1K2H_K29_SIZE                                   0x1
#define _PID1K2H_K29_LENGTH                                 0x1
#define _PID1K2H_K29_MASK                                   0x2
#define _PID1K2H_K210_POSN                                  0x2
#define _PID1K2H_K210_POSITION                              0x2
#define _PID1K2H_K210_SIZE                                  0x1
#define _PID1K2H_K210_LENGTH                                0x1
#define _PID1K2H_K210_MASK                                  0x4
#define _PID1K2H_K211_POSN                                  0x3
#define _PID1K2H_K211_POSITION                              0x3
#define _PID1K2H_K211_SIZE                                  0x1
#define _PID1K2H_K211_LENGTH                                0x1
#define _PID1K2H_K211_MASK                                  0x8
#define _PID1K2H_K212_POSN                                  0x4
#define _PID1K2H_K212_POSITION                              0x4
#define _PID1K2H_K212_SIZE                                  0x1
#define _PID1K2H_K212_LENGTH                                0x1
#define _PID1K2H_K212_MASK                                  0x10
#define _PID1K2H_K213_POSN                                  0x5
#define _PID1K2H_K213_POSITION                              0x5
#define _PID1K2H_K213_SIZE                                  0x1
#define _PID1K2H_K213_LENGTH                                0x1
#define _PID1K2H_K213_MASK                                  0x20
#define _PID1K2H_K214_POSN                                  0x6
#define _PID1K2H_K214_POSITION                              0x6
#define _PID1K2H_K214_SIZE                                  0x1
#define _PID1K2H_K214_LENGTH                                0x1
#define _PID1K2H_K214_MASK                                  0x40
#define _PID1K2H_K215_POSN                                  0x7
#define _PID1K2H_K215_POSITION                              0x7
#define _PID1K2H_K215_SIZE                                  0x1
#define _PID1K2H_K215_LENGTH                                0x1
#define _PID1K2H_K215_MASK                                  0x80

// Register: PID1K3
#define PID1K3 PID1K3
extern volatile unsigned short          PID1K3              __at(0x594);
#ifndef _LIB_BUILD
asm("PID1K3 equ 0594h");
#endif

// Register: PID1K3L
#define PID1K3L PID1K3L
extern volatile unsigned char           PID1K3L             __at(0x594);
#ifndef _LIB_BUILD
asm("PID1K3L equ 0594h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID1K30                :1;
        unsigned PID1K31                :1;
        unsigned PID1K32                :1;
        unsigned PID1K33                :1;
        unsigned PID1K34                :1;
        unsigned PID1K35                :1;
        unsigned PID1K36                :1;
        unsigned PID1K37                :1;
    };
    struct {
        unsigned K30                    :1;
        unsigned K31                    :1;
        unsigned K32                    :1;
        unsigned K33                    :1;
        unsigned K34                    :1;
        unsigned K35                    :1;
        unsigned K36                    :1;
        unsigned K37                    :1;
    };
} PID1K3Lbits_t;
extern volatile PID1K3Lbits_t PID1K3Lbits __at(0x594);
// bitfield macros
#define _PID1K3L_PID1K30_POSN                               0x0
#define _PID1K3L_PID1K30_POSITION                           0x0
#define _PID1K3L_PID1K30_SIZE                               0x1
#define _PID1K3L_PID1K30_LENGTH                             0x1
#define _PID1K3L_PID1K30_MASK                               0x1
#define _PID1K3L_PID1K31_POSN                               0x1
#define _PID1K3L_PID1K31_POSITION                           0x1
#define _PID1K3L_PID1K31_SIZE                               0x1
#define _PID1K3L_PID1K31_LENGTH                             0x1
#define _PID1K3L_PID1K31_MASK                               0x2
#define _PID1K3L_PID1K32_POSN                               0x2
#define _PID1K3L_PID1K32_POSITION                           0x2
#define _PID1K3L_PID1K32_SIZE                               0x1
#define _PID1K3L_PID1K32_LENGTH                             0x1
#define _PID1K3L_PID1K32_MASK                               0x4
#define _PID1K3L_PID1K33_POSN                               0x3
#define _PID1K3L_PID1K33_POSITION                           0x3
#define _PID1K3L_PID1K33_SIZE                               0x1
#define _PID1K3L_PID1K33_LENGTH                             0x1
#define _PID1K3L_PID1K33_MASK                               0x8
#define _PID1K3L_PID1K34_POSN                               0x4
#define _PID1K3L_PID1K34_POSITION                           0x4
#define _PID1K3L_PID1K34_SIZE                               0x1
#define _PID1K3L_PID1K34_LENGTH                             0x1
#define _PID1K3L_PID1K34_MASK                               0x10
#define _PID1K3L_PID1K35_POSN                               0x5
#define _PID1K3L_PID1K35_POSITION                           0x5
#define _PID1K3L_PID1K35_SIZE                               0x1
#define _PID1K3L_PID1K35_LENGTH                             0x1
#define _PID1K3L_PID1K35_MASK                               0x20
#define _PID1K3L_PID1K36_POSN                               0x6
#define _PID1K3L_PID1K36_POSITION                           0x6
#define _PID1K3L_PID1K36_SIZE                               0x1
#define _PID1K3L_PID1K36_LENGTH                             0x1
#define _PID1K3L_PID1K36_MASK                               0x40
#define _PID1K3L_PID1K37_POSN                               0x7
#define _PID1K3L_PID1K37_POSITION                           0x7
#define _PID1K3L_PID1K37_SIZE                               0x1
#define _PID1K3L_PID1K37_LENGTH                             0x1
#define _PID1K3L_PID1K37_MASK                               0x80
#define _PID1K3L_K30_POSN                                   0x0
#define _PID1K3L_K30_POSITION                               0x0
#define _PID1K3L_K30_SIZE                                   0x1
#define _PID1K3L_K30_LENGTH                                 0x1
#define _PID1K3L_K30_MASK                                   0x1
#define _PID1K3L_K31_POSN                                   0x1
#define _PID1K3L_K31_POSITION                               0x1
#define _PID1K3L_K31_SIZE                                   0x1
#define _PID1K3L_K31_LENGTH                                 0x1
#define _PID1K3L_K31_MASK                                   0x2
#define _PID1K3L_K32_POSN                                   0x2
#define _PID1K3L_K32_POSITION                               0x2
#define _PID1K3L_K32_SIZE                                   0x1
#define _PID1K3L_K32_LENGTH                                 0x1
#define _PID1K3L_K32_MASK                                   0x4
#define _PID1K3L_K33_POSN                                   0x3
#define _PID1K3L_K33_POSITION                               0x3
#define _PID1K3L_K33_SIZE                                   0x1
#define _PID1K3L_K33_LENGTH                                 0x1
#define _PID1K3L_K33_MASK                                   0x8
#define _PID1K3L_K34_POSN                                   0x4
#define _PID1K3L_K34_POSITION                               0x4
#define _PID1K3L_K34_SIZE                                   0x1
#define _PID1K3L_K34_LENGTH                                 0x1
#define _PID1K3L_K34_MASK                                   0x10
#define _PID1K3L_K35_POSN                                   0x5
#define _PID1K3L_K35_POSITION                               0x5
#define _PID1K3L_K35_SIZE                                   0x1
#define _PID1K3L_K35_LENGTH                                 0x1
#define _PID1K3L_K35_MASK                                   0x20
#define _PID1K3L_K36_POSN                                   0x6
#define _PID1K3L_K36_POSITION                               0x6
#define _PID1K3L_K36_SIZE                                   0x1
#define _PID1K3L_K36_LENGTH                                 0x1
#define _PID1K3L_K36_MASK                                   0x40
#define _PID1K3L_K37_POSN                                   0x7
#define _PID1K3L_K37_POSITION                               0x7
#define _PID1K3L_K37_SIZE                                   0x1
#define _PID1K3L_K37_LENGTH                                 0x1
#define _PID1K3L_K37_MASK                                   0x80

// Register: PID1K3H
#define PID1K3H PID1K3H
extern volatile unsigned char           PID1K3H             __at(0x595);
#ifndef _LIB_BUILD
asm("PID1K3H equ 0595h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID1K38                :1;
        unsigned PID1K39                :1;
        unsigned PID1K310               :1;
        unsigned PID1K311               :1;
        unsigned PID1K312               :1;
        unsigned PID1K313               :1;
        unsigned PID1K314               :1;
        unsigned PID1K315               :1;
    };
    struct {
        unsigned K38                    :1;
        unsigned K39                    :1;
        unsigned K310                   :1;
        unsigned K311                   :1;
        unsigned K312                   :1;
        unsigned K313                   :1;
        unsigned K314                   :1;
        unsigned K315                   :1;
    };
} PID1K3Hbits_t;
