MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1614/mcu.h
// Register: PID1OUTHH
#define PID1OUTHH PID1OUTHH
extern volatile unsigned char           PID1OUTHH           __at(0x599);
#ifndef _LIB_BUILD
asm("PID1OUTHH equ 0599h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID1OUT24              :1;
        unsigned PID1OUT25              :1;
        unsigned PID1OUT26              :1;
        unsigned PID1OUT27              :1;
        unsigned PID1OUT28              :1;
        unsigned PID1OUT29              :1;
        unsigned PID1OUT30              :1;
        unsigned PID1OUT31              :1;
    };
    struct {
        unsigned OUT24                  :1;
        unsigned OUT25                  :1;
        unsigned OUT26                  :1;
        unsigned OUT27                  :1;
        unsigned OUT28                  :1;
        unsigned OUT29                  :1;
        unsigned OUT30                  :1;
        unsigned OUT31                  :1;
    };
} PID1OUTHHbits_t;
extern volatile PID1OUTHHbits_t PID1OUTHHbits __at(0x599);
// bitfield macros
#define _PID1OUTHH_PID1OUT24_POSN                           0x0
#define _PID1OUTHH_PID1OUT24_POSITION                       0x0
#define _PID1OUTHH_PID1OUT24_SIZE                           0x1
#define _PID1OUTHH_PID1OUT24_LENGTH                         0x1
#define _PID1OUTHH_PID1OUT24_MASK                           0x1
#define _PID1OUTHH_PID1OUT25_POSN                           0x1
#define _PID1OUTHH_PID1OUT25_POSITION                       0x1
#define _PID1OUTHH_PID1OUT25_SIZE                           0x1
#define _PID1OUTHH_PID1OUT25_LENGTH                         0x1
#define _PID1OUTHH_PID1OUT25_MASK                           0x2
#define _PID1OUTHH_PID1OUT26_POSN                           0x2
#define _PID1OUTHH_PID1OUT26_POSITION                       0x2
#define _PID1OUTHH_PID1OUT26_SIZE                           0x1
#define _PID1OUTHH_PID1OUT26_LENGTH                         0x1
#define _PID1OUTHH_PID1OUT26_MASK                           0x4
#define _PID1OUTHH_PID1OUT27_POSN                           0x3
#define _PID1OUTHH_PID1OUT27_POSITION                       0x3
#define _PID1OUTHH_PID1OUT27_SIZE                           0x1
#define _PID1OUTHH_PID1OUT27_LENGTH                         0x1
#define _PID1OUTHH_PID1OUT27_MASK                           0x8
#define _PID1OUTHH_PID1OUT28_POSN                           0x4
#define _PID1OUTHH_PID1OUT28_POSITION                       0x4
#define _PID1OUTHH_PID1OUT28_SIZE                           0x1
#define _PID1OUTHH_PID1OUT28_LENGTH                         0x1
#define _PID1OUTHH_PID1OUT28_MASK                           0x10
#define _PID1OUTHH_PID1OUT29_POSN                           0x5
#define _PID1OUTHH_PID1OUT29_POSITION                       0x5
#define _PID1OUTHH_PID1OUT29_SIZE                           0x1
#define _PID1OUTHH_PID1OUT29_LENGTH                         0x1
#define _PID1OUTHH_PID1OUT29_MASK                           0x20
#define _PID1OUTHH_PID1OUT30_POSN                           0x6
#define _PID1OUTHH_PID1OUT30_POSITION                       0x6
#define _PID1OUTHH_PID1OUT30_SIZE                           0x1
#define _PID1OUTHH_PID1OUT30_LENGTH                         0x1
#define _PID1OUTHH_PID1OUT30_MASK                           0x40
#define _PID1OUTHH_PID1OUT31_POSN                           0x7
#define _PID1OUTHH_PID1OUT31_POSITION                       0x7
#define _PID1OUTHH_PID1OUT31_SIZE                           0x1
#define _PID1OUTHH_PID1OUT31_LENGTH                         0x1
#define _PID1OUTHH_PID1OUT31_MASK                           0x80
#define _PID1OUTHH_OUT24_POSN                               0x0
#define _PID1OUTHH_OUT24_POSITION                           0x0
#define _PID1OUTHH_OUT24_SIZE                               0x1
#define _PID1OUTHH_OUT24_LENGTH                             0x1
#define _PID1OUTHH_OUT24_MASK                               0x1
#define _PID1OUTHH_OUT25_POSN                               0x1
#define _PID1OUTHH_OUT25_POSITION                           0x1
#define _PID1OUTHH_OUT25_SIZE                               0x1
#define _PID1OUTHH_OUT25_LENGTH                             0x1
#define _PID1OUTHH_OUT25_MASK                               0x2
#define _PID1OUTHH_OUT26_POSN                               0x2
#define _PID1OUTHH_OUT26_POSITION                           0x2
#define _PID1OUTHH_OUT26_SIZE                               0x1
#define _PID1OUTHH_OUT26_LENGTH                             0x1
#define _PID1OUTHH_OUT26_MASK                               0x4
#define _PID1OUTHH_OUT27_POSN                               0x3
#define _PID1OUTHH_OUT27_POSITION                           0x3
#define _PID1OUTHH_OUT27_SIZE                               0x1
#define _PID1OUTHH_OUT27_LENGTH                             0x1
#define _PID1OUTHH_OUT27_MASK                               0x8
#define _PID1OUTHH_OUT28_POSN                               0x4
#define _PID1OUTHH_OUT28_POSITION                           0x4
#define _PID1OUTHH_OUT28_SIZE                               0x1
#define _PID1OUTHH_OUT28_LENGTH                             0x1
#define _PID1OUTHH_OUT28_MASK                               0x10
#define _PID1OUTHH_OUT29_POSN                               0x5
#define _PID1OUTHH_OUT29_POSITION                           0x5
#define _PID1OUTHH_OUT29_SIZE                               0x1
#define _PID1OUTHH_OUT29_LENGTH                             0x1
#define _PID1OUTHH_OUT29_MASK                               0x20
#define _PID1OUTHH_OUT30_POSN                               0x6
#define _PID1OUTHH_OUT30_POSITION                           0x6
#define _PID1OUTHH_OUT30_SIZE                               0x1
#define _PID1OUTHH_OUT30_LENGTH                             0x1
#define _PID1OUTHH_OUT30_MASK                               0x40
#define _PID1OUTHH_OUT31_POSN                               0x7
#define _PID1OUTHH_OUT31_POSITION                           0x7
#define _PID1OUTHH_OUT31_SIZE                               0x1
#define _PID1OUTHH_OUT31_LENGTH                             0x1
#define _PID1OUTHH_OUT31_MASK                               0x80

// Register: PID1OUTU
#define PID1OUTU PID1OUTU
extern volatile unsigned char           PID1OUTU            __at(0x59A);
#ifndef _LIB_BUILD
asm("PID1OUTU equ 059Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID1OUT32              :1;
        unsigned PID1OUT33              :1;
        unsigned PID1OUT34              :1;
        unsigned PID1OUT35              :1;
    };
    struct {
        unsigned OUT32                  :1;
        unsigned OUT33                  :1;
        unsigned OUT34                  :1;
        unsigned OUT35                  :1;
    };
} PID1OUTUbits_t;
extern volatile PID1OUTUbits_t PID1OUTUbits __at(0x59A);
// bitfield macros
#define _PID1OUTU_PID1OUT32_POSN                            0x0
#define _PID1OUTU_PID1OUT32_POSITION                        0x0
#define _PID1OUTU_PID1OUT32_SIZE                            0x1
#define _PID1OUTU_PID1OUT32_LENGTH                          0x1
#define _PID1OUTU_PID1OUT32_MASK                            0x1
#define _PID1OUTU_PID1OUT33_POSN                            0x1
#define _PID1OUTU_PID1OUT33_POSITION                        0x1
#define _PID1OUTU_PID1OUT33_SIZE                            0x1
#define _PID1OUTU_PID1OUT33_LENGTH                          0x1
#define _PID1OUTU_PID1OUT33_MASK                            0x2
#define _PID1OUTU_PID1OUT34_POSN                            0x2
#define _PID1OUTU_PID1OUT34_POSITION                        0x2
#define _PID1OUTU_PID1OUT34_SIZE                            0x1
#define _PID1OUTU_PID1OUT34_LENGTH                          0x1
#define _PID1OUTU_PID1OUT34_MASK                            0x4
#define _PID1OUTU_PID1OUT35_POSN                            0x3
#define _PID1OUTU_PID1OUT35_POSITION                        0x3
#define _PID1OUTU_PID1OUT35_SIZE                            0x1
#define _PID1OUTU_PID1OUT35_LENGTH                          0x1
#define _PID1OUTU_PID1OUT35_MASK                            0x8
#define _PID1OUTU_OUT32_POSN                                0x0
#define _PID1OUTU_OUT32_POSITION                            0x0
#define _PID1OUTU_OUT32_SIZE                                0x1
#define _PID1OUTU_OUT32_LENGTH                              0x1
#define _PID1OUTU_OUT32_MASK                                0x1
#define _PID1OUTU_OUT33_POSN                                0x1
#define _PID1OUTU_OUT33_POSITION                            0x1
#define _PID1OUTU_OUT33_SIZE                                0x1
#define _PID1OUTU_OUT33_LENGTH                              0x1
#define _PID1OUTU_OUT33_MASK                                0x2
#define _PID1OUTU_OUT34_POSN                                0x2
#define _PID1OUTU_OUT34_POSITION                            0x2
#define _PID1OUTU_OUT34_SIZE                                0x1
#define _PID1OUTU_OUT34_LENGTH                              0x1
#define _PID1OUTU_OUT34_MASK                                0x4
#define _PID1OUTU_OUT35_POSN                                0x3
#define _PID1OUTU_OUT35_POSITION                            0x3
#define _PID1OUTU_OUT35_SIZE                                0x1
#define _PID1OUTU_OUT35_LENGTH                              0x1
#define _PID1OUTU_OUT35_MASK                                0x8

// Register: PID1Z1
#define PID1Z1 PID1Z1
#ifndef __CCI__
extern volatile __uint24                PID1Z1              __at(0x59B);
#endif
#ifndef _LIB_BUILD
asm("PID1Z1 equ 059Bh");
#endif

// Register: PID1Z1L
#define PID1Z1L PID1Z1L
extern volatile unsigned char           PID1Z1L             __at(0x59B);
#ifndef _LIB_BUILD
asm("PID1Z1L equ 059Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID1Z10                :1;
        unsigned PID1Z11                :1;
        unsigned PID1Z12                :1;
        unsigned PID1Z13                :1;
        unsigned PID1Z14                :1;
        unsigned PID1Z15                :1;
        unsigned PID1Z16                :1;
        unsigned PID1Z17                :1;
    };
    struct {
        unsigned Z10                    :1;
        unsigned Z11                    :1;
        unsigned Z12                    :1;
        unsigned Z13                    :1;
        unsigned Z14                    :1;
        unsigned Z15                    :1;
        unsigned Z16                    :1;
        unsigned Z17                    :1;
    };
} PID1Z1Lbits_t;
