MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1614/mcu.h
extern volatile PID1Z2Hbits_t PID1Z2Hbits __at(0x60D);
// bitfield macros
#define _PID1Z2H_PID1Z28_POSN                               0x0
#define _PID1Z2H_PID1Z28_POSITION                           0x0
#define _PID1Z2H_PID1Z28_SIZE                               0x1
#define _PID1Z2H_PID1Z28_LENGTH                             0x1
#define _PID1Z2H_PID1Z28_MASK                               0x1
#define _PID1Z2H_PID1Z29_POSN                               0x1
#define _PID1Z2H_PID1Z29_POSITION                           0x1
#define _PID1Z2H_PID1Z29_SIZE                               0x1
#define _PID1Z2H_PID1Z29_LENGTH                             0x1
#define _PID1Z2H_PID1Z29_MASK                               0x2
#define _PID1Z2H_PID1Z210_POSN                              0x2
#define _PID1Z2H_PID1Z210_POSITION                          0x2
#define _PID1Z2H_PID1Z210_SIZE                              0x1
#define _PID1Z2H_PID1Z210_LENGTH                            0x1
#define _PID1Z2H_PID1Z210_MASK                              0x4
#define _PID1Z2H_PID1Z211_POSN                              0x3
#define _PID1Z2H_PID1Z211_POSITION                          0x3
#define _PID1Z2H_PID1Z211_SIZE                              0x1
#define _PID1Z2H_PID1Z211_LENGTH                            0x1
#define _PID1Z2H_PID1Z211_MASK                              0x8
#define _PID1Z2H_PID1Z212_POSN                              0x4
#define _PID1Z2H_PID1Z212_POSITION                          0x4
#define _PID1Z2H_PID1Z212_SIZE                              0x1
#define _PID1Z2H_PID1Z212_LENGTH                            0x1
#define _PID1Z2H_PID1Z212_MASK                              0x10
#define _PID1Z2H_PID1Z213_POSN                              0x5
#define _PID1Z2H_PID1Z213_POSITION                          0x5
#define _PID1Z2H_PID1Z213_SIZE                              0x1
#define _PID1Z2H_PID1Z213_LENGTH                            0x1
#define _PID1Z2H_PID1Z213_MASK                              0x20
#define _PID1Z2H_PID1Z214_POSN                              0x6
#define _PID1Z2H_PID1Z214_POSITION                          0x6
#define _PID1Z2H_PID1Z214_SIZE                              0x1
#define _PID1Z2H_PID1Z214_LENGTH                            0x1
#define _PID1Z2H_PID1Z214_MASK                              0x40
#define _PID1Z2H_PID1Z215_POSN                              0x7
#define _PID1Z2H_PID1Z215_POSITION                          0x7
#define _PID1Z2H_PID1Z215_SIZE                              0x1
#define _PID1Z2H_PID1Z215_LENGTH                            0x1
#define _PID1Z2H_PID1Z215_MASK                              0x80
#define _PID1Z2H_Z28_POSN                                   0x0
#define _PID1Z2H_Z28_POSITION                               0x0
#define _PID1Z2H_Z28_SIZE                                   0x1
#define _PID1Z2H_Z28_LENGTH                                 0x1
#define _PID1Z2H_Z28_MASK                                   0x1
#define _PID1Z2H_Z29_POSN                                   0x1
#define _PID1Z2H_Z29_POSITION                               0x1
#define _PID1Z2H_Z29_SIZE                                   0x1
#define _PID1Z2H_Z29_LENGTH                                 0x1
#define _PID1Z2H_Z29_MASK                                   0x2
#define _PID1Z2H_Z210_POSN                                  0x2
#define _PID1Z2H_Z210_POSITION                              0x2
#define _PID1Z2H_Z210_SIZE                                  0x1
#define _PID1Z2H_Z210_LENGTH                                0x1
#define _PID1Z2H_Z210_MASK                                  0x4
#define _PID1Z2H_Z211_POSN                                  0x3
#define _PID1Z2H_Z211_POSITION                              0x3
#define _PID1Z2H_Z211_SIZE                                  0x1
#define _PID1Z2H_Z211_LENGTH                                0x1
#define _PID1Z2H_Z211_MASK                                  0x8
#define _PID1Z2H_Z212_POSN                                  0x4
#define _PID1Z2H_Z212_POSITION                              0x4
#define _PID1Z2H_Z212_SIZE                                  0x1
#define _PID1Z2H_Z212_LENGTH                                0x1
#define _PID1Z2H_Z212_MASK                                  0x10
#define _PID1Z2H_Z213_POSN                                  0x5
#define _PID1Z2H_Z213_POSITION                              0x5
#define _PID1Z2H_Z213_SIZE                                  0x1
#define _PID1Z2H_Z213_LENGTH                                0x1
#define _PID1Z2H_Z213_MASK                                  0x20
#define _PID1Z2H_Z214_POSN                                  0x6
#define _PID1Z2H_Z214_POSITION                              0x6
#define _PID1Z2H_Z214_SIZE                                  0x1
#define _PID1Z2H_Z214_LENGTH                                0x1
#define _PID1Z2H_Z214_MASK                                  0x40
#define _PID1Z2H_Z215_POSN                                  0x7
#define _PID1Z2H_Z215_POSITION                              0x7
#define _PID1Z2H_Z215_SIZE                                  0x1
#define _PID1Z2H_Z215_LENGTH                                0x1
#define _PID1Z2H_Z215_MASK                                  0x80

// Register: PID1Z2U
#define PID1Z2U PID1Z2U
extern volatile unsigned char           PID1Z2U             __at(0x60E);
#ifndef _LIB_BUILD
asm("PID1Z2U equ 060Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID1Z216               :1;
    };
    struct {
        unsigned Z216                   :1;
    };
} PID1Z2Ubits_t;
extern volatile PID1Z2Ubits_t PID1Z2Ubits __at(0x60E);
// bitfield macros
#define _PID1Z2U_PID1Z216_POSN                              0x0
#define _PID1Z2U_PID1Z216_POSITION                          0x0
#define _PID1Z2U_PID1Z216_SIZE                              0x1
#define _PID1Z2U_PID1Z216_LENGTH                            0x1
#define _PID1Z2U_PID1Z216_MASK                              0x1
#define _PID1Z2U_Z216_POSN                                  0x0
#define _PID1Z2U_Z216_POSITION                              0x0
#define _PID1Z2U_Z216_SIZE                                  0x1
#define _PID1Z2U_Z216_LENGTH                                0x1
#define _PID1Z2U_Z216_MASK                                  0x1

// Register: PID1ACC
#define PID1ACC PID1ACC
#ifndef _LIB_BUILD
asm("PID1ACC equ 060Fh");
#endif

