MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1614/mcu.h
extern volatile PID1ACCLHbits_t PID1ACCLHbits __at(0x610);
// bitfield macros
#define _PID1ACCLH_PID1ACC8_POSN                            0x0
#define _PID1ACCLH_PID1ACC8_POSITION                        0x0
#define _PID1ACCLH_PID1ACC8_SIZE                            0x1
#define _PID1ACCLH_PID1ACC8_LENGTH                          0x1
#define _PID1ACCLH_PID1ACC8_MASK                            0x1
#define _PID1ACCLH_PID1ACC9_POSN                            0x1
#define _PID1ACCLH_PID1ACC9_POSITION                        0x1
#define _PID1ACCLH_PID1ACC9_SIZE                            0x1
#define _PID1ACCLH_PID1ACC9_LENGTH                          0x1
#define _PID1ACCLH_PID1ACC9_MASK                            0x2
#define _PID1ACCLH_PID1ACC10_POSN                           0x2
#define _PID1ACCLH_PID1ACC10_POSITION                       0x2
#define _PID1ACCLH_PID1ACC10_SIZE                           0x1
#define _PID1ACCLH_PID1ACC10_LENGTH                         0x1
#define _PID1ACCLH_PID1ACC10_MASK                           0x4
#define _PID1ACCLH_PID1ACC11_POSN                           0x3
#define _PID1ACCLH_PID1ACC11_POSITION                       0x3
#define _PID1ACCLH_PID1ACC11_SIZE                           0x1
#define _PID1ACCLH_PID1ACC11_LENGTH                         0x1
#define _PID1ACCLH_PID1ACC11_MASK                           0x8
#define _PID1ACCLH_PID1ACC12_POSN                           0x4
#define _PID1ACCLH_PID1ACC12_POSITION                       0x4
#define _PID1ACCLH_PID1ACC12_SIZE                           0x1
#define _PID1ACCLH_PID1ACC12_LENGTH                         0x1
#define _PID1ACCLH_PID1ACC12_MASK                           0x10
#define _PID1ACCLH_PID1ACC13_POSN                           0x5
#define _PID1ACCLH_PID1ACC13_POSITION                       0x5
#define _PID1ACCLH_PID1ACC13_SIZE                           0x1
#define _PID1ACCLH_PID1ACC13_LENGTH                         0x1
#define _PID1ACCLH_PID1ACC13_MASK                           0x20
#define _PID1ACCLH_PID1ACC14_POSN                           0x6
#define _PID1ACCLH_PID1ACC14_POSITION                       0x6
#define _PID1ACCLH_PID1ACC14_SIZE                           0x1
#define _PID1ACCLH_PID1ACC14_LENGTH                         0x1
#define _PID1ACCLH_PID1ACC14_MASK                           0x40
#define _PID1ACCLH_PID1ACC15_POSN                           0x7
#define _PID1ACCLH_PID1ACC15_POSITION                       0x7
#define _PID1ACCLH_PID1ACC15_SIZE                           0x1
#define _PID1ACCLH_PID1ACC15_LENGTH                         0x1
#define _PID1ACCLH_PID1ACC15_MASK                           0x80
#define _PID1ACCLH_ACC8_POSN                                0x0
#define _PID1ACCLH_ACC8_POSITION                            0x0
#define _PID1ACCLH_ACC8_SIZE                                0x1
#define _PID1ACCLH_ACC8_LENGTH                              0x1
#define _PID1ACCLH_ACC8_MASK                                0x1
#define _PID1ACCLH_ACC9_POSN                                0x1
#define _PID1ACCLH_ACC9_POSITION                            0x1
#define _PID1ACCLH_ACC9_SIZE                                0x1
#define _PID1ACCLH_ACC9_LENGTH                              0x1
#define _PID1ACCLH_ACC9_MASK                                0x2
#define _PID1ACCLH_ACC10_POSN                               0x2
#define _PID1ACCLH_ACC10_POSITION                           0x2
#define _PID1ACCLH_ACC10_SIZE                               0x1
#define _PID1ACCLH_ACC10_LENGTH                             0x1
#define _PID1ACCLH_ACC10_MASK                               0x4
#define _PID1ACCLH_ACC11_POSN                               0x3
#define _PID1ACCLH_ACC11_POSITION                           0x3
#define _PID1ACCLH_ACC11_SIZE                               0x1
#define _PID1ACCLH_ACC11_LENGTH                             0x1
#define _PID1ACCLH_ACC11_MASK                               0x8
#define _PID1ACCLH_ACC12_POSN                               0x4
#define _PID1ACCLH_ACC12_POSITION                           0x4
#define _PID1ACCLH_ACC12_SIZE                               0x1
#define _PID1ACCLH_ACC12_LENGTH                             0x1
#define _PID1ACCLH_ACC12_MASK                               0x10
#define _PID1ACCLH_ACC13_POSN                               0x5
#define _PID1ACCLH_ACC13_POSITION                           0x5
#define _PID1ACCLH_ACC13_SIZE                               0x1
#define _PID1ACCLH_ACC13_LENGTH                             0x1
#define _PID1ACCLH_ACC13_MASK                               0x20
#define _PID1ACCLH_ACC14_POSN                               0x6
#define _PID1ACCLH_ACC14_POSITION                           0x6
#define _PID1ACCLH_ACC14_SIZE                               0x1
#define _PID1ACCLH_ACC14_LENGTH                             0x1
#define _PID1ACCLH_ACC14_MASK                               0x40
#define _PID1ACCLH_ACC15_POSN                               0x7
#define _PID1ACCLH_ACC15_POSITION                           0x7
#define _PID1ACCLH_ACC15_SIZE                               0x1
#define _PID1ACCLH_ACC15_LENGTH                             0x1
#define _PID1ACCLH_ACC15_MASK                               0x80

// Register: PID1ACCHL
#define PID1ACCHL PID1ACCHL
extern volatile unsigned char           PID1ACCHL           __at(0x611);
#ifndef _LIB_BUILD
asm("PID1ACCHL equ 0611h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID1ACC16              :1;
        unsigned PID1ACC17              :1;
        unsigned PID1ACC18              :1;
        unsigned PID1ACC19              :1;
        unsigned PID1ACC20              :1;
        unsigned PID1ACC21              :1;
        unsigned PID1ACC22              :1;
        unsigned PID1ACC23              :1;
    };
    struct {
        unsigned ACC16                  :1;
        unsigned ACC17                  :1;
        unsigned ACC18                  :1;
        unsigned ACC19                  :1;
        unsigned ACC20                  :1;
        unsigned ACC21                  :1;
        unsigned ACC22                  :1;
        unsigned ACC23                  :1;
    };
} PID1ACCHLbits_t;
extern volatile PID1ACCHLbits_t PID1ACCHLbits __at(0x611);
// bitfield macros
#define _PID1ACCHL_PID1ACC16_POSN                           0x0
#define _PID1ACCHL_PID1ACC16_POSITION                       0x0
#define _PID1ACCHL_PID1ACC16_SIZE                           0x1
#define _PID1ACCHL_PID1ACC16_LENGTH                         0x1
#define _PID1ACCHL_PID1ACC16_MASK                           0x1
#define _PID1ACCHL_PID1ACC17_POSN                           0x1
#define _PID1ACCHL_PID1ACC17_POSITION                       0x1
#define _PID1ACCHL_PID1ACC17_SIZE                           0x1
#define _PID1ACCHL_PID1ACC17_LENGTH                         0x1
#define _PID1ACCHL_PID1ACC17_MASK                           0x2
#define _PID1ACCHL_PID1ACC18_POSN                           0x2
#define _PID1ACCHL_PID1ACC18_POSITION                       0x2
#define _PID1ACCHL_PID1ACC18_SIZE                           0x1
#define _PID1ACCHL_PID1ACC18_LENGTH                         0x1
#define _PID1ACCHL_PID1ACC18_MASK                           0x4
#define _PID1ACCHL_PID1ACC19_POSN                           0x3
#define _PID1ACCHL_PID1ACC19_POSITION                       0x3
#define _PID1ACCHL_PID1ACC19_SIZE                           0x1
#define _PID1ACCHL_PID1ACC19_LENGTH                         0x1
#define _PID1ACCHL_PID1ACC19_MASK                           0x8
#define _PID1ACCHL_PID1ACC20_POSN                           0x4
#define _PID1ACCHL_PID1ACC20_POSITION                       0x4
#define _PID1ACCHL_PID1ACC20_SIZE                           0x1
#define _PID1ACCHL_PID1ACC20_LENGTH                         0x1
#define _PID1ACCHL_PID1ACC20_MASK                           0x10
#define _PID1ACCHL_PID1ACC21_POSN                           0x5
#define _PID1ACCHL_PID1ACC21_POSITION                       0x5
#define _PID1ACCHL_PID1ACC21_SIZE                           0x1
#define _PID1ACCHL_PID1ACC21_LENGTH                         0x1
#define _PID1ACCHL_PID1ACC21_MASK                           0x20
#define _PID1ACCHL_PID1ACC22_POSN                           0x6
#define _PID1ACCHL_PID1ACC22_POSITION                       0x6
#define _PID1ACCHL_PID1ACC22_SIZE                           0x1
#define _PID1ACCHL_PID1ACC22_LENGTH                         0x1
#define _PID1ACCHL_PID1ACC22_MASK                           0x40
#define _PID1ACCHL_PID1ACC23_POSN                           0x7
#define _PID1ACCHL_PID1ACC23_POSITION                       0x7
#define _PID1ACCHL_PID1ACC23_SIZE                           0x1
#define _PID1ACCHL_PID1ACC23_LENGTH                         0x1
#define _PID1ACCHL_PID1ACC23_MASK                           0x80
#define _PID1ACCHL_ACC16_POSN                               0x0
#define _PID1ACCHL_ACC16_POSITION                           0x0
#define _PID1ACCHL_ACC16_SIZE                               0x1
#define _PID1ACCHL_ACC16_LENGTH                             0x1
#define _PID1ACCHL_ACC16_MASK                               0x1
#define _PID1ACCHL_ACC17_POSN                               0x1
#define _PID1ACCHL_ACC17_POSITION                           0x1
#define _PID1ACCHL_ACC17_SIZE                               0x1
#define _PID1ACCHL_ACC17_LENGTH                             0x1
#define _PID1ACCHL_ACC17_MASK                               0x2
#define _PID1ACCHL_ACC18_POSN                               0x2
#define _PID1ACCHL_ACC18_POSITION                           0x2
#define _PID1ACCHL_ACC18_SIZE                               0x1
#define _PID1ACCHL_ACC18_LENGTH                             0x1
#define _PID1ACCHL_ACC18_MASK                               0x4
#define _PID1ACCHL_ACC19_POSN                               0x3
#define _PID1ACCHL_ACC19_POSITION                           0x3
#define _PID1ACCHL_ACC19_SIZE                               0x1
#define _PID1ACCHL_ACC19_LENGTH                             0x1
#define _PID1ACCHL_ACC19_MASK                               0x8
#define _PID1ACCHL_ACC20_POSN                               0x4
#define _PID1ACCHL_ACC20_POSITION                           0x4
#define _PID1ACCHL_ACC20_SIZE                               0x1
#define _PID1ACCHL_ACC20_LENGTH                             0x1
#define _PID1ACCHL_ACC20_MASK                               0x10
#define _PID1ACCHL_ACC21_POSN                               0x5
#define _PID1ACCHL_ACC21_POSITION                           0x5
#define _PID1ACCHL_ACC21_SIZE                               0x1
#define _PID1ACCHL_ACC21_LENGTH                             0x1
#define _PID1ACCHL_ACC21_MASK                               0x20
#define _PID1ACCHL_ACC22_POSN                               0x6
#define _PID1ACCHL_ACC22_POSITION                           0x6
#define _PID1ACCHL_ACC22_SIZE                               0x1
#define _PID1ACCHL_ACC22_LENGTH                             0x1
#define _PID1ACCHL_ACC22_MASK                               0x40
#define _PID1ACCHL_ACC23_POSN                               0x7
#define _PID1ACCHL_ACC23_POSITION                           0x7
#define _PID1ACCHL_ACC23_SIZE                               0x1
#define _PID1ACCHL_ACC23_LENGTH                             0x1
#define _PID1ACCHL_ACC23_MASK                               0x80

// Register: PID1ACCHH
#define PID1ACCHH PID1ACCHH
extern volatile unsigned char           PID1ACCHH           __at(0x612);
#ifndef _LIB_BUILD
asm("PID1ACCHH equ 0612h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID1ACC24              :1;
        unsigned PID1ACC25              :1;
        unsigned PID1ACC26              :1;
        unsigned PID1ACC27              :1;
        unsigned PID1ACC28              :1;
        unsigned PID1ACC29              :1;
        unsigned PID1ACC30              :1;
        unsigned PID1ACC31              :1;
    };
    struct {
        unsigned ACC24                  :1;
        unsigned ACC25                  :1;
        unsigned ACC26                  :1;
        unsigned ACC27                  :1;
        unsigned ACC28                  :1;
        unsigned ACC29                  :1;
        unsigned ACC30                  :1;
        unsigned ACC31                  :1;
    };
} PID1ACCHHbits_t;
extern volatile PID1ACCHHbits_t PID1ACCHHbits __at(0x612);
// bitfield macros
#define _PID1ACCHH_PID1ACC24_POSN                           0x0
#define _PID1ACCHH_PID1ACC24_POSITION                       0x0
#define _PID1ACCHH_PID1ACC24_SIZE                           0x1
#define _PID1ACCHH_PID1ACC24_LENGTH                         0x1
#define _PID1ACCHH_PID1ACC24_MASK                           0x1
#define _PID1ACCHH_PID1ACC25_POSN                           0x1
#define _PID1ACCHH_PID1ACC25_POSITION                       0x1
#define _PID1ACCHH_PID1ACC25_SIZE                           0x1
#define _PID1ACCHH_PID1ACC25_LENGTH                         0x1
#define _PID1ACCHH_PID1ACC25_MASK                           0x2
#define _PID1ACCHH_PID1ACC26_POSN                           0x2
#define _PID1ACCHH_PID1ACC26_POSITION                       0x2
#define _PID1ACCHH_PID1ACC26_SIZE                           0x1
#define _PID1ACCHH_PID1ACC26_LENGTH                         0x1
#define _PID1ACCHH_PID1ACC26_MASK                           0x4
#define _PID1ACCHH_PID1ACC27_POSN                           0x3
#define _PID1ACCHH_PID1ACC27_POSITION                       0x3
#define _PID1ACCHH_PID1ACC27_SIZE                           0x1
#define _PID1ACCHH_PID1ACC27_LENGTH                         0x1
#define _PID1ACCHH_PID1ACC27_MASK                           0x8
#define _PID1ACCHH_PID1ACC28_POSN                           0x4
#define _PID1ACCHH_PID1ACC28_POSITION                       0x4
#define _PID1ACCHH_PID1ACC28_SIZE                           0x1
#define _PID1ACCHH_PID1ACC28_LENGTH                         0x1
#define _PID1ACCHH_PID1ACC28_MASK                           0x10
#define _PID1ACCHH_PID1ACC29_POSN                           0x5
#define _PID1ACCHH_PID1ACC29_POSITION                       0x5
#define _PID1ACCHH_PID1ACC29_SIZE                           0x1
#define _PID1ACCHH_PID1ACC29_LENGTH                         0x1
#define _PID1ACCHH_PID1ACC29_MASK                           0x20
#define _PID1ACCHH_PID1ACC30_POSN                           0x6
#define _PID1ACCHH_PID1ACC30_POSITION                       0x6
#define _PID1ACCHH_PID1ACC30_SIZE                           0x1
#define _PID1ACCHH_PID1ACC30_LENGTH                         0x1
#define _PID1ACCHH_PID1ACC30_MASK                           0x40
#define _PID1ACCHH_PID1ACC31_POSN                           0x7
#define _PID1ACCHH_PID1ACC31_POSITION                       0x7
#define _PID1ACCHH_PID1ACC31_SIZE                           0x1
#define _PID1ACCHH_PID1ACC31_LENGTH                         0x1
#define _PID1ACCHH_PID1ACC31_MASK                           0x80
#define _PID1ACCHH_ACC24_POSN                               0x0
#define _PID1ACCHH_ACC24_POSITION                           0x0
#define _PID1ACCHH_ACC24_SIZE                               0x1
#define _PID1ACCHH_ACC24_LENGTH                             0x1
#define _PID1ACCHH_ACC24_MASK                               0x1
#define _PID1ACCHH_ACC25_POSN                               0x1
#define _PID1ACCHH_ACC25_POSITION                           0x1
#define _PID1ACCHH_ACC25_SIZE                               0x1
#define _PID1ACCHH_ACC25_LENGTH                             0x1
#define _PID1ACCHH_ACC25_MASK                               0x2
#define _PID1ACCHH_ACC26_POSN                               0x2
#define _PID1ACCHH_ACC26_POSITION                           0x2
#define _PID1ACCHH_ACC26_SIZE                               0x1
#define _PID1ACCHH_ACC26_LENGTH                             0x1
#define _PID1ACCHH_ACC26_MASK                               0x4
#define _PID1ACCHH_ACC27_POSN                               0x3
#define _PID1ACCHH_ACC27_POSITION                           0x3
#define _PID1ACCHH_ACC27_SIZE                               0x1
#define _PID1ACCHH_ACC27_LENGTH                             0x1
#define _PID1ACCHH_ACC27_MASK                               0x8
#define _PID1ACCHH_ACC28_POSN                               0x4
#define _PID1ACCHH_ACC28_POSITION                           0x4
#define _PID1ACCHH_ACC28_SIZE                               0x1
#define _PID1ACCHH_ACC28_LENGTH                             0x1
#define _PID1ACCHH_ACC28_MASK                               0x10
#define _PID1ACCHH_ACC29_POSN                               0x5
#define _PID1ACCHH_ACC29_POSITION                           0x5
#define _PID1ACCHH_ACC29_SIZE                               0x1
#define _PID1ACCHH_ACC29_LENGTH                             0x1
#define _PID1ACCHH_ACC29_MASK                               0x20
#define _PID1ACCHH_ACC30_POSN                               0x6
#define _PID1ACCHH_ACC30_POSITION                           0x6
#define _PID1ACCHH_ACC30_SIZE                               0x1
#define _PID1ACCHH_ACC30_LENGTH                             0x1
#define _PID1ACCHH_ACC30_MASK                               0x40
#define _PID1ACCHH_ACC31_POSN                               0x7
#define _PID1ACCHH_ACC31_POSITION                           0x7
#define _PID1ACCHH_ACC31_SIZE                               0x1
#define _PID1ACCHH_ACC31_LENGTH                             0x1
#define _PID1ACCHH_ACC31_MASK                               0x80

