MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1614/mcu.h
// Register: CRCDATH
#define CRCDATH CRCDATH
extern volatile unsigned char           CRCDATH             __at(0x792);
#ifndef _LIB_BUILD
asm("CRCDATH equ 0792h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DAT                    :8;
    };
    struct {
        unsigned DAT8                   :1;
        unsigned DAT9                   :1;
        unsigned DAT10                  :1;
        unsigned DAT11                  :1;
        unsigned DAT12                  :1;
        unsigned DAT13                  :1;
        unsigned DAT14                  :1;
        unsigned DAT15                  :1;
    };
    struct {
        unsigned CRCDAT                 :8;
    };
    struct {
        unsigned CRCDAT8                :1;
        unsigned CRCDAT9                :1;
        unsigned CRCDAT10               :1;
        unsigned CRCDAT11               :1;
        unsigned CRCDAT12               :1;
        unsigned CRCDAT13               :1;
        unsigned CRCDAT14               :1;
        unsigned CRCDAT15               :1;
    };
} CRCDATHbits_t;
extern volatile CRCDATHbits_t CRCDATHbits __at(0x792);
// bitfield macros
#define _CRCDATH_DAT_POSN                                   0x0
#define _CRCDATH_DAT_POSITION                               0x0
#define _CRCDATH_DAT_SIZE                                   0x8
#define _CRCDATH_DAT_LENGTH                                 0x8
#define _CRCDATH_DAT_MASK                                   0xFF
#define _CRCDATH_DAT8_POSN                                  0x0
#define _CRCDATH_DAT8_POSITION                              0x0
#define _CRCDATH_DAT8_SIZE                                  0x1
#define _CRCDATH_DAT8_LENGTH                                0x1
#define _CRCDATH_DAT8_MASK                                  0x1
#define _CRCDATH_DAT9_POSN                                  0x1
#define _CRCDATH_DAT9_POSITION                              0x1
#define _CRCDATH_DAT9_SIZE                                  0x1
#define _CRCDATH_DAT9_LENGTH                                0x1
#define _CRCDATH_DAT9_MASK                                  0x2
#define _CRCDATH_DAT10_POSN                                 0x2
#define _CRCDATH_DAT10_POSITION                             0x2
#define _CRCDATH_DAT10_SIZE                                 0x1
#define _CRCDATH_DAT10_LENGTH                               0x1
#define _CRCDATH_DAT10_MASK                                 0x4
#define _CRCDATH_DAT11_POSN                                 0x3
#define _CRCDATH_DAT11_POSITION                             0x3
#define _CRCDATH_DAT11_SIZE                                 0x1
#define _CRCDATH_DAT11_LENGTH                               0x1
#define _CRCDATH_DAT11_MASK                                 0x8
#define _CRCDATH_DAT12_POSN                                 0x4
#define _CRCDATH_DAT12_POSITION                             0x4
#define _CRCDATH_DAT12_SIZE                                 0x1
#define _CRCDATH_DAT12_LENGTH                               0x1
#define _CRCDATH_DAT12_MASK                                 0x10
#define _CRCDATH_DAT13_POSN                                 0x5
#define _CRCDATH_DAT13_POSITION                             0x5
#define _CRCDATH_DAT13_SIZE                                 0x1
#define _CRCDATH_DAT13_LENGTH                               0x1
#define _CRCDATH_DAT13_MASK                                 0x20
#define _CRCDATH_DAT14_POSN                                 0x6
#define _CRCDATH_DAT14_POSITION                             0x6
#define _CRCDATH_DAT14_SIZE                                 0x1
#define _CRCDATH_DAT14_LENGTH                               0x1
#define _CRCDATH_DAT14_MASK                                 0x40
#define _CRCDATH_DAT15_POSN                                 0x7
#define _CRCDATH_DAT15_POSITION                             0x7
#define _CRCDATH_DAT15_SIZE                                 0x1
#define _CRCDATH_DAT15_LENGTH                               0x1
#define _CRCDATH_DAT15_MASK                                 0x80
#define _CRCDATH_CRCDAT_POSN                                0x0
#define _CRCDATH_CRCDAT_POSITION                            0x0
#define _CRCDATH_CRCDAT_SIZE                                0x8
#define _CRCDATH_CRCDAT_LENGTH                              0x8
#define _CRCDATH_CRCDAT_MASK                                0xFF
#define _CRCDATH_CRCDAT8_POSN                               0x0
#define _CRCDATH_CRCDAT8_POSITION                           0x0
#define _CRCDATH_CRCDAT8_SIZE                               0x1
#define _CRCDATH_CRCDAT8_LENGTH                             0x1
#define _CRCDATH_CRCDAT8_MASK                               0x1
#define _CRCDATH_CRCDAT9_POSN                               0x1
#define _CRCDATH_CRCDAT9_POSITION                           0x1
#define _CRCDATH_CRCDAT9_SIZE                               0x1
#define _CRCDATH_CRCDAT9_LENGTH                             0x1
#define _CRCDATH_CRCDAT9_MASK                               0x2
#define _CRCDATH_CRCDAT10_POSN                              0x2
#define _CRCDATH_CRCDAT10_POSITION                          0x2
#define _CRCDATH_CRCDAT10_SIZE                              0x1
#define _CRCDATH_CRCDAT10_LENGTH                            0x1
#define _CRCDATH_CRCDAT10_MASK                              0x4
#define _CRCDATH_CRCDAT11_POSN                              0x3
#define _CRCDATH_CRCDAT11_POSITION                          0x3
#define _CRCDATH_CRCDAT11_SIZE                              0x1
#define _CRCDATH_CRCDAT11_LENGTH                            0x1
#define _CRCDATH_CRCDAT11_MASK                              0x8
#define _CRCDATH_CRCDAT12_POSN                              0x4
#define _CRCDATH_CRCDAT12_POSITION                          0x4
#define _CRCDATH_CRCDAT12_SIZE                              0x1
#define _CRCDATH_CRCDAT12_LENGTH                            0x1
#define _CRCDATH_CRCDAT12_MASK                              0x10
#define _CRCDATH_CRCDAT13_POSN                              0x5
#define _CRCDATH_CRCDAT13_POSITION                          0x5
#define _CRCDATH_CRCDAT13_SIZE                              0x1
#define _CRCDATH_CRCDAT13_LENGTH                            0x1
#define _CRCDATH_CRCDAT13_MASK                              0x20
#define _CRCDATH_CRCDAT14_POSN                              0x6
#define _CRCDATH_CRCDAT14_POSITION                          0x6
#define _CRCDATH_CRCDAT14_SIZE                              0x1
#define _CRCDATH_CRCDAT14_LENGTH                            0x1
#define _CRCDATH_CRCDAT14_MASK                              0x40
#define _CRCDATH_CRCDAT15_POSN                              0x7
#define _CRCDATH_CRCDAT15_POSITION                          0x7
#define _CRCDATH_CRCDAT15_SIZE                              0x1
#define _CRCDATH_CRCDAT15_LENGTH                            0x1
#define _CRCDATH_CRCDAT15_MASK                              0x80

// Register: CRCACC
#define CRCACC CRCACC
extern volatile unsigned short          CRCACC              __at(0x793);
#ifndef _LIB_BUILD
asm("CRCACC equ 0793h");
#endif

// Register: CRCACCL
#define CRCACCL CRCACCL
extern volatile unsigned char           CRCACCL             __at(0x793);
#ifndef _LIB_BUILD
asm("CRCACCL equ 0793h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ACC                    :8;
    };
    struct {
        unsigned ACC0                   :1;
        unsigned ACC1                   :1;
        unsigned ACC2                   :1;
        unsigned ACC3                   :1;
        unsigned ACC4                   :1;
        unsigned ACC5                   :1;
        unsigned ACC6                   :1;
        unsigned ACC7                   :1;
    };
    struct {
        unsigned CRCACC                 :8;
    };
    struct {
        unsigned CRCACC0                :1;
        unsigned CRCACC1                :1;
        unsigned CRCACC2                :1;
        unsigned CRCACC3                :1;
        unsigned CRCACC4                :1;
        unsigned CRCACC5                :1;
        unsigned CRCACC6                :1;
        unsigned CRCACC7                :1;
    };
} CRCACCLbits_t;
extern volatile CRCACCLbits_t CRCACCLbits __at(0x793);
// bitfield macros
#define _CRCACCL_ACC_POSN                                   0x0
#define _CRCACCL_ACC_POSITION                               0x0
#define _CRCACCL_ACC_SIZE                                   0x8
#define _CRCACCL_ACC_LENGTH                                 0x8
#define _CRCACCL_ACC_MASK                                   0xFF
#define _CRCACCL_ACC0_POSN                                  0x0
#define _CRCACCL_ACC0_POSITION                              0x0
#define _CRCACCL_ACC0_SIZE                                  0x1
#define _CRCACCL_ACC0_LENGTH                                0x1
#define _CRCACCL_ACC0_MASK                                  0x1
#define _CRCACCL_ACC1_POSN                                  0x1
#define _CRCACCL_ACC1_POSITION                              0x1
#define _CRCACCL_ACC1_SIZE                                  0x1
#define _CRCACCL_ACC1_LENGTH                                0x1
#define _CRCACCL_ACC1_MASK                                  0x2
#define _CRCACCL_ACC2_POSN                                  0x2
#define _CRCACCL_ACC2_POSITION                              0x2
#define _CRCACCL_ACC2_SIZE                                  0x1
#define _CRCACCL_ACC2_LENGTH                                0x1
#define _CRCACCL_ACC2_MASK                                  0x4
#define _CRCACCL_ACC3_POSN                                  0x3
#define _CRCACCL_ACC3_POSITION                              0x3
#define _CRCACCL_ACC3_SIZE                                  0x1
#define _CRCACCL_ACC3_LENGTH                                0x1
#define _CRCACCL_ACC3_MASK                                  0x8
#define _CRCACCL_ACC4_POSN                                  0x4
#define _CRCACCL_ACC4_POSITION                              0x4
#define _CRCACCL_ACC4_SIZE                                  0x1
#define _CRCACCL_ACC4_LENGTH                                0x1
#define _CRCACCL_ACC4_MASK                                  0x10
#define _CRCACCL_ACC5_POSN                                  0x5
#define _CRCACCL_ACC5_POSITION                              0x5
#define _CRCACCL_ACC5_SIZE                                  0x1
#define _CRCACCL_ACC5_LENGTH                                0x1
#define _CRCACCL_ACC5_MASK                                  0x20
#define _CRCACCL_ACC6_POSN                                  0x6
#define _CRCACCL_ACC6_POSITION                              0x6
#define _CRCACCL_ACC6_SIZE                                  0x1
#define _CRCACCL_ACC6_LENGTH                                0x1
#define _CRCACCL_ACC6_MASK                                  0x40
#define _CRCACCL_ACC7_POSN                                  0x7
#define _CRCACCL_ACC7_POSITION                              0x7
#define _CRCACCL_ACC7_SIZE                                  0x1
#define _CRCACCL_ACC7_LENGTH                                0x1
#define _CRCACCL_ACC7_MASK                                  0x80
#define _CRCACCL_CRCACC_POSN                                0x0
#define _CRCACCL_CRCACC_POSITION                            0x0
#define _CRCACCL_CRCACC_SIZE                                0x8
#define _CRCACCL_CRCACC_LENGTH                              0x8
#define _CRCACCL_CRCACC_MASK                                0xFF
#define _CRCACCL_CRCACC0_POSN                               0x0
#define _CRCACCL_CRCACC0_POSITION                           0x0
#define _CRCACCL_CRCACC0_SIZE                               0x1
#define _CRCACCL_CRCACC0_LENGTH                             0x1
#define _CRCACCL_CRCACC0_MASK                               0x1
#define _CRCACCL_CRCACC1_POSN                               0x1
#define _CRCACCL_CRCACC1_POSITION                           0x1
#define _CRCACCL_CRCACC1_SIZE                               0x1
#define _CRCACCL_CRCACC1_LENGTH                             0x1
#define _CRCACCL_CRCACC1_MASK                               0x2
#define _CRCACCL_CRCACC2_POSN                               0x2
#define _CRCACCL_CRCACC2_POSITION                           0x2
#define _CRCACCL_CRCACC2_SIZE                               0x1
#define _CRCACCL_CRCACC2_LENGTH                             0x1
#define _CRCACCL_CRCACC2_MASK                               0x4
#define _CRCACCL_CRCACC3_POSN                               0x3
#define _CRCACCL_CRCACC3_POSITION                           0x3
#define _CRCACCL_CRCACC3_SIZE                               0x1
#define _CRCACCL_CRCACC3_LENGTH                             0x1
#define _CRCACCL_CRCACC3_MASK                               0x8
#define _CRCACCL_CRCACC4_POSN                               0x4
#define _CRCACCL_CRCACC4_POSITION                           0x4
#define _CRCACCL_CRCACC4_SIZE                               0x1
#define _CRCACCL_CRCACC4_LENGTH                             0x1
#define _CRCACCL_CRCACC4_MASK                               0x10
#define _CRCACCL_CRCACC5_POSN                               0x5
#define _CRCACCL_CRCACC5_POSITION                           0x5
#define _CRCACCL_CRCACC5_SIZE                               0x1
#define _CRCACCL_CRCACC5_LENGTH                             0x1
#define _CRCACCL_CRCACC5_MASK                               0x20
#define _CRCACCL_CRCACC6_POSN                               0x6
#define _CRCACCL_CRCACC6_POSITION                           0x6
#define _CRCACCL_CRCACC6_SIZE                               0x1
#define _CRCACCL_CRCACC6_LENGTH                             0x1
#define _CRCACCL_CRCACC6_MASK                               0x40
#define _CRCACCL_CRCACC7_POSN                               0x7
#define _CRCACCL_CRCACC7_POSITION                           0x7
#define _CRCACCL_CRCACC7_SIZE                               0x1
#define _CRCACCL_CRCACC7_LENGTH                             0x1
#define _CRCACCL_CRCACC7_MASK                               0x80

// Register: CRCACCH
#define CRCACCH CRCACCH
extern volatile unsigned char           CRCACCH             __at(0x794);
#ifndef _LIB_BUILD
asm("CRCACCH equ 0794h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ACC                    :8;
    };
    struct {
        unsigned ACC8                   :1;
        unsigned ACC9                   :1;
        unsigned ACC10                  :1;
        unsigned ACC11                  :1;
        unsigned ACC12                  :1;
        unsigned ACC13                  :1;
        unsigned ACC14                  :1;
        unsigned ACC15                  :1;
    };
    struct {
        unsigned CRCACC                 :8;
    };
    struct {
        unsigned CRCACC8                :1;
        unsigned CRCACC9                :1;
        unsigned CRCACC10               :1;
        unsigned CRCACC11               :1;
        unsigned CRCACC12               :1;
        unsigned CRCACC13               :1;
        unsigned CRCACC14               :1;
        unsigned CRCACC15               :1;
    };
} CRCACCHbits_t;
