MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1614/mcu.h
// Register: CRCSHIFTH
#define CRCSHIFTH CRCSHIFTH
extern volatile unsigned char           CRCSHIFTH           __at(0x796);
#ifndef _LIB_BUILD
asm("CRCSHIFTH equ 0796h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SHIFT                  :8;
    };
    struct {
        unsigned SHIFT8                 :1;
        unsigned SHIFT9                 :1;
        unsigned SHIFT10                :1;
        unsigned SHIFT11                :1;
        unsigned SHIFT12                :1;
        unsigned SHIFT13                :1;
        unsigned SHIFT14                :1;
        unsigned SHIFT15                :1;
    };
    struct {
        unsigned CRCSHIFT               :8;
    };
    struct {
        unsigned CRCSHIFT8              :1;
        unsigned CRCSHIFT9              :1;
        unsigned CRCSHIFT10             :1;
        unsigned CRCSHIFT11             :1;
        unsigned CRCSHIFT12             :1;
        unsigned CRCSHIFT13             :1;
        unsigned CRCSHIFT14             :1;
        unsigned CRCSHIFT15             :1;
    };
} CRCSHIFTHbits_t;
extern volatile CRCSHIFTHbits_t CRCSHIFTHbits __at(0x796);
// bitfield macros
#define _CRCSHIFTH_SHIFT_POSN                               0x0
#define _CRCSHIFTH_SHIFT_POSITION                           0x0
#define _CRCSHIFTH_SHIFT_SIZE                               0x8
#define _CRCSHIFTH_SHIFT_LENGTH                             0x8
#define _CRCSHIFTH_SHIFT_MASK                               0xFF
#define _CRCSHIFTH_SHIFT8_POSN                              0x0
#define _CRCSHIFTH_SHIFT8_POSITION                          0x0
#define _CRCSHIFTH_SHIFT8_SIZE                              0x1
#define _CRCSHIFTH_SHIFT8_LENGTH                            0x1
#define _CRCSHIFTH_SHIFT8_MASK                              0x1
#define _CRCSHIFTH_SHIFT9_POSN                              0x1
#define _CRCSHIFTH_SHIFT9_POSITION                          0x1
#define _CRCSHIFTH_SHIFT9_SIZE                              0x1
#define _CRCSHIFTH_SHIFT9_LENGTH                            0x1
#define _CRCSHIFTH_SHIFT9_MASK                              0x2
#define _CRCSHIFTH_SHIFT10_POSN                             0x2
#define _CRCSHIFTH_SHIFT10_POSITION                         0x2
#define _CRCSHIFTH_SHIFT10_SIZE                             0x1
#define _CRCSHIFTH_SHIFT10_LENGTH                           0x1
#define _CRCSHIFTH_SHIFT10_MASK                             0x4
#define _CRCSHIFTH_SHIFT11_POSN                             0x3
#define _CRCSHIFTH_SHIFT11_POSITION                         0x3
#define _CRCSHIFTH_SHIFT11_SIZE                             0x1
#define _CRCSHIFTH_SHIFT11_LENGTH                           0x1
#define _CRCSHIFTH_SHIFT11_MASK                             0x8
#define _CRCSHIFTH_SHIFT12_POSN                             0x4
#define _CRCSHIFTH_SHIFT12_POSITION                         0x4
#define _CRCSHIFTH_SHIFT12_SIZE                             0x1
#define _CRCSHIFTH_SHIFT12_LENGTH                           0x1
#define _CRCSHIFTH_SHIFT12_MASK                             0x10
#define _CRCSHIFTH_SHIFT13_POSN                             0x5
#define _CRCSHIFTH_SHIFT13_POSITION                         0x5
#define _CRCSHIFTH_SHIFT13_SIZE                             0x1
#define _CRCSHIFTH_SHIFT13_LENGTH                           0x1
#define _CRCSHIFTH_SHIFT13_MASK                             0x20
#define _CRCSHIFTH_SHIFT14_POSN                             0x6
#define _CRCSHIFTH_SHIFT14_POSITION                         0x6
#define _CRCSHIFTH_SHIFT14_SIZE                             0x1
#define _CRCSHIFTH_SHIFT14_LENGTH                           0x1
#define _CRCSHIFTH_SHIFT14_MASK                             0x40
#define _CRCSHIFTH_SHIFT15_POSN                             0x7
#define _CRCSHIFTH_SHIFT15_POSITION                         0x7
#define _CRCSHIFTH_SHIFT15_SIZE                             0x1
#define _CRCSHIFTH_SHIFT15_LENGTH                           0x1
#define _CRCSHIFTH_SHIFT15_MASK                             0x80
#define _CRCSHIFTH_CRCSHIFT_POSN                            0x0
#define _CRCSHIFTH_CRCSHIFT_POSITION                        0x0
#define _CRCSHIFTH_CRCSHIFT_SIZE                            0x8
#define _CRCSHIFTH_CRCSHIFT_LENGTH                          0x8
#define _CRCSHIFTH_CRCSHIFT_MASK                            0xFF
#define _CRCSHIFTH_CRCSHIFT8_POSN                           0x0
#define _CRCSHIFTH_CRCSHIFT8_POSITION                       0x0
#define _CRCSHIFTH_CRCSHIFT8_SIZE                           0x1
#define _CRCSHIFTH_CRCSHIFT8_LENGTH                         0x1
#define _CRCSHIFTH_CRCSHIFT8_MASK                           0x1
#define _CRCSHIFTH_CRCSHIFT9_POSN                           0x1
#define _CRCSHIFTH_CRCSHIFT9_POSITION                       0x1
#define _CRCSHIFTH_CRCSHIFT9_SIZE                           0x1
#define _CRCSHIFTH_CRCSHIFT9_LENGTH                         0x1
#define _CRCSHIFTH_CRCSHIFT9_MASK                           0x2
#define _CRCSHIFTH_CRCSHIFT10_POSN                          0x2
#define _CRCSHIFTH_CRCSHIFT10_POSITION                      0x2
#define _CRCSHIFTH_CRCSHIFT10_SIZE                          0x1
#define _CRCSHIFTH_CRCSHIFT10_LENGTH                        0x1
#define _CRCSHIFTH_CRCSHIFT10_MASK                          0x4
#define _CRCSHIFTH_CRCSHIFT11_POSN                          0x3
#define _CRCSHIFTH_CRCSHIFT11_POSITION                      0x3
#define _CRCSHIFTH_CRCSHIFT11_SIZE                          0x1
#define _CRCSHIFTH_CRCSHIFT11_LENGTH                        0x1
#define _CRCSHIFTH_CRCSHIFT11_MASK                          0x8
#define _CRCSHIFTH_CRCSHIFT12_POSN                          0x4
#define _CRCSHIFTH_CRCSHIFT12_POSITION                      0x4
#define _CRCSHIFTH_CRCSHIFT12_SIZE                          0x1
#define _CRCSHIFTH_CRCSHIFT12_LENGTH                        0x1
#define _CRCSHIFTH_CRCSHIFT12_MASK                          0x10
#define _CRCSHIFTH_CRCSHIFT13_POSN                          0x5
#define _CRCSHIFTH_CRCSHIFT13_POSITION                      0x5
#define _CRCSHIFTH_CRCSHIFT13_SIZE                          0x1
#define _CRCSHIFTH_CRCSHIFT13_LENGTH                        0x1
#define _CRCSHIFTH_CRCSHIFT13_MASK                          0x20
#define _CRCSHIFTH_CRCSHIFT14_POSN                          0x6
#define _CRCSHIFTH_CRCSHIFT14_POSITION                      0x6
#define _CRCSHIFTH_CRCSHIFT14_SIZE                          0x1
#define _CRCSHIFTH_CRCSHIFT14_LENGTH                        0x1
#define _CRCSHIFTH_CRCSHIFT14_MASK                          0x40
#define _CRCSHIFTH_CRCSHIFT15_POSN                          0x7
#define _CRCSHIFTH_CRCSHIFT15_POSITION                      0x7
#define _CRCSHIFTH_CRCSHIFT15_SIZE                          0x1
#define _CRCSHIFTH_CRCSHIFT15_LENGTH                        0x1
#define _CRCSHIFTH_CRCSHIFT15_MASK                          0x80

