MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1614/mcu.h
extern volatile AT1CC2Hbits_t AT1CC2Hbits __at(0x894);
// bitfield macros
#define _AT1CC2H_AT1CC28_POSN                               0x0
#define _AT1CC2H_AT1CC28_POSITION                           0x0
#define _AT1CC2H_AT1CC28_SIZE                               0x1
#define _AT1CC2H_AT1CC28_LENGTH                             0x1
#define _AT1CC2H_AT1CC28_MASK                               0x1
#define _AT1CC2H_AT1CC29_POSN                               0x1
#define _AT1CC2H_AT1CC29_POSITION                           0x1
#define _AT1CC2H_AT1CC29_SIZE                               0x1
#define _AT1CC2H_AT1CC29_LENGTH                             0x1
#define _AT1CC2H_AT1CC29_MASK                               0x2
#define _AT1CC2H_CC28_POSN                                  0x0
#define _AT1CC2H_CC28_POSITION                              0x0
#define _AT1CC2H_CC28_SIZE                                  0x1
#define _AT1CC2H_CC28_LENGTH                                0x1
#define _AT1CC2H_CC28_MASK                                  0x1
#define _AT1CC2H_CC29_POSN                                  0x1
#define _AT1CC2H_CC29_POSITION                              0x1
#define _AT1CC2H_CC29_SIZE                                  0x1
#define _AT1CC2H_CC29_LENGTH                                0x1
#define _AT1CC2H_CC29_MASK                                  0x2

// Register: AT1CCON2
#define AT1CCON2 AT1CCON2
extern volatile unsigned char           AT1CCON2            __at(0x895);
#ifndef _LIB_BUILD
asm("AT1CCON2 equ 0895h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AT1CC2MODE             :1;
        unsigned                        :2;
        unsigned AT1CAP2P               :1;
        unsigned AT1CC2POL              :1;
        unsigned                        :2;
        unsigned AT1CC2EN               :1;
    };
    struct {
        unsigned CC2MODE                :1;
        unsigned                        :2;
        unsigned CAP2P                  :1;
        unsigned CC2POL                 :1;
        unsigned                        :2;
        unsigned CC2EN                  :1;
    };
} AT1CCON2bits_t;
extern volatile AT1CCON2bits_t AT1CCON2bits __at(0x895);
// bitfield macros
#define _AT1CCON2_AT1CC2MODE_POSN                           0x0
#define _AT1CCON2_AT1CC2MODE_POSITION                       0x0
#define _AT1CCON2_AT1CC2MODE_SIZE                           0x1
#define _AT1CCON2_AT1CC2MODE_LENGTH                         0x1
#define _AT1CCON2_AT1CC2MODE_MASK                           0x1
#define _AT1CCON2_AT1CAP2P_POSN                             0x3
#define _AT1CCON2_AT1CAP2P_POSITION                         0x3
#define _AT1CCON2_AT1CAP2P_SIZE                             0x1
#define _AT1CCON2_AT1CAP2P_LENGTH                           0x1
#define _AT1CCON2_AT1CAP2P_MASK                             0x8
#define _AT1CCON2_AT1CC2POL_POSN                            0x4
#define _AT1CCON2_AT1CC2POL_POSITION                        0x4
#define _AT1CCON2_AT1CC2POL_SIZE                            0x1
#define _AT1CCON2_AT1CC2POL_LENGTH                          0x1
#define _AT1CCON2_AT1CC2POL_MASK                            0x10
#define _AT1CCON2_AT1CC2EN_POSN                             0x7
#define _AT1CCON2_AT1CC2EN_POSITION                         0x7
#define _AT1CCON2_AT1CC2EN_SIZE                             0x1
#define _AT1CCON2_AT1CC2EN_LENGTH                           0x1
#define _AT1CCON2_AT1CC2EN_MASK                             0x80
#define _AT1CCON2_CC2MODE_POSN                              0x0
#define _AT1CCON2_CC2MODE_POSITION                          0x0
#define _AT1CCON2_CC2MODE_SIZE                              0x1
#define _AT1CCON2_CC2MODE_LENGTH                            0x1
#define _AT1CCON2_CC2MODE_MASK                              0x1
#define _AT1CCON2_CAP2P_POSN                                0x3
#define _AT1CCON2_CAP2P_POSITION                            0x3
#define _AT1CCON2_CAP2P_SIZE                                0x1
#define _AT1CCON2_CAP2P_LENGTH                              0x1
#define _AT1CCON2_CAP2P_MASK                                0x8
#define _AT1CCON2_CC2POL_POSN                               0x4
#define _AT1CCON2_CC2POL_POSITION                           0x4
#define _AT1CCON2_CC2POL_SIZE                               0x1
#define _AT1CCON2_CC2POL_LENGTH                             0x1
#define _AT1CCON2_CC2POL_MASK                               0x10
#define _AT1CCON2_CC2EN_POSN                                0x7
#define _AT1CCON2_CC2EN_POSITION                            0x7
#define _AT1CCON2_CC2EN_SIZE                                0x1
#define _AT1CCON2_CC2EN_LENGTH                              0x1
#define _AT1CCON2_CC2EN_MASK                                0x80

// Register: AT1CSEL3
#define AT1CSEL3 AT1CSEL3
extern volatile unsigned char           AT1CSEL3            __at(0x896);
#ifndef _LIB_BUILD
asm("AT1CSEL3 equ 0896h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AT1CP3S                :3;
    };
    struct {
        unsigned AT1CP3S0               :1;
        unsigned AT1CP3S1               :1;
        unsigned AT1CP3S2               :1;
    };
    struct {
        unsigned CP3S                   :3;
    };
    struct {
        unsigned CP3S0                  :1;
        unsigned CP3S1                  :1;
        unsigned CP3S2                  :1;
    };
} AT1CSEL3bits_t;
extern volatile AT1CSEL3bits_t AT1CSEL3bits __at(0x896);
// bitfield macros
#define _AT1CSEL3_AT1CP3S_POSN                              0x0
#define _AT1CSEL3_AT1CP3S_POSITION                          0x0
#define _AT1CSEL3_AT1CP3S_SIZE                              0x3
#define _AT1CSEL3_AT1CP3S_LENGTH                            0x3
#define _AT1CSEL3_AT1CP3S_MASK                              0x7
#define _AT1CSEL3_AT1CP3S0_POSN                             0x0
#define _AT1CSEL3_AT1CP3S0_POSITION                         0x0
#define _AT1CSEL3_AT1CP3S0_SIZE                             0x1
#define _AT1CSEL3_AT1CP3S0_LENGTH                           0x1
#define _AT1CSEL3_AT1CP3S0_MASK                             0x1
#define _AT1CSEL3_AT1CP3S1_POSN                             0x1
#define _AT1CSEL3_AT1CP3S1_POSITION                         0x1
#define _AT1CSEL3_AT1CP3S1_SIZE                             0x1
#define _AT1CSEL3_AT1CP3S1_LENGTH                           0x1
#define _AT1CSEL3_AT1CP3S1_MASK                             0x2
#define _AT1CSEL3_AT1CP3S2_POSN                             0x2
#define _AT1CSEL3_AT1CP3S2_POSITION                         0x2
#define _AT1CSEL3_AT1CP3S2_SIZE                             0x1
#define _AT1CSEL3_AT1CP3S2_LENGTH                           0x1
#define _AT1CSEL3_AT1CP3S2_MASK                             0x4
#define _AT1CSEL3_CP3S_POSN                                 0x0
#define _AT1CSEL3_CP3S_POSITION                             0x0
#define _AT1CSEL3_CP3S_SIZE                                 0x3
#define _AT1CSEL3_CP3S_LENGTH                               0x3
#define _AT1CSEL3_CP3S_MASK                                 0x7
#define _AT1CSEL3_CP3S0_POSN                                0x0
#define _AT1CSEL3_CP3S0_POSITION                            0x0
#define _AT1CSEL3_CP3S0_SIZE                                0x1
#define _AT1CSEL3_CP3S0_LENGTH                              0x1
#define _AT1CSEL3_CP3S0_MASK                                0x1
#define _AT1CSEL3_CP3S1_POSN                                0x1
#define _AT1CSEL3_CP3S1_POSITION                            0x1
#define _AT1CSEL3_CP3S1_SIZE                                0x1
#define _AT1CSEL3_CP3S1_LENGTH                              0x1
#define _AT1CSEL3_CP3S1_MASK                                0x2
#define _AT1CSEL3_CP3S2_POSN                                0x2
#define _AT1CSEL3_CP3S2_POSITION                            0x2
#define _AT1CSEL3_CP3S2_SIZE                                0x1
#define _AT1CSEL3_CP3S2_LENGTH                              0x1
#define _AT1CSEL3_CP3S2_MASK                                0x4

// Register: AT1CC3
#define AT1CC3 AT1CC3
extern volatile unsigned short          AT1CC3              __at(0x897);
#ifndef _LIB_BUILD
asm("AT1CC3 equ 0897h");
#endif

// Register: AT1CC3L
#define AT1CC3L AT1CC3L
extern volatile unsigned char           AT1CC3L             __at(0x897);
#ifndef _LIB_BUILD
asm("AT1CC3L equ 0897h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AT1CC30                :1;
        unsigned AT1CC31                :1;
        unsigned AT1CC32                :1;
        unsigned AT1CC33                :1;
        unsigned AT1CC34                :1;
        unsigned AT1CC35                :1;
        unsigned AT1CC36                :1;
        unsigned AT1CC37                :1;
    };
    struct {
        unsigned CC30                   :1;
        unsigned CC31                   :1;
        unsigned CC32                   :1;
        unsigned CC33                   :1;
        unsigned CC34                   :1;
        unsigned CC35                   :1;
        unsigned CC36                   :1;
        unsigned CC37                   :1;
    };
} AT1CC3Lbits_t;
extern volatile AT1CC3Lbits_t AT1CC3Lbits __at(0x897);
// bitfield macros
#define _AT1CC3L_AT1CC30_POSN                               0x0
#define _AT1CC3L_AT1CC30_POSITION                           0x0
#define _AT1CC3L_AT1CC30_SIZE                               0x1
#define _AT1CC3L_AT1CC30_LENGTH                             0x1
#define _AT1CC3L_AT1CC30_MASK                               0x1
#define _AT1CC3L_AT1CC31_POSN                               0x1
#define _AT1CC3L_AT1CC31_POSITION                           0x1
#define _AT1CC3L_AT1CC31_SIZE                               0x1
#define _AT1CC3L_AT1CC31_LENGTH                             0x1
#define _AT1CC3L_AT1CC31_MASK                               0x2
#define _AT1CC3L_AT1CC32_POSN                               0x2
#define _AT1CC3L_AT1CC32_POSITION                           0x2
#define _AT1CC3L_AT1CC32_SIZE                               0x1
#define _AT1CC3L_AT1CC32_LENGTH                             0x1
#define _AT1CC3L_AT1CC32_MASK                               0x4
#define _AT1CC3L_AT1CC33_POSN                               0x3
#define _AT1CC3L_AT1CC33_POSITION                           0x3
#define _AT1CC3L_AT1CC33_SIZE                               0x1
#define _AT1CC3L_AT1CC33_LENGTH                             0x1
#define _AT1CC3L_AT1CC33_MASK                               0x8
#define _AT1CC3L_AT1CC34_POSN                               0x4
#define _AT1CC3L_AT1CC34_POSITION                           0x4
#define _AT1CC3L_AT1CC34_SIZE                               0x1
#define _AT1CC3L_AT1CC34_LENGTH                             0x1
#define _AT1CC3L_AT1CC34_MASK                               0x10
#define _AT1CC3L_AT1CC35_POSN                               0x5
#define _AT1CC3L_AT1CC35_POSITION                           0x5
#define _AT1CC3L_AT1CC35_SIZE                               0x1
#define _AT1CC3L_AT1CC35_LENGTH                             0x1
#define _AT1CC3L_AT1CC35_MASK                               0x20
#define _AT1CC3L_AT1CC36_POSN                               0x6
#define _AT1CC3L_AT1CC36_POSITION                           0x6
#define _AT1CC3L_AT1CC36_SIZE                               0x1
#define _AT1CC3L_AT1CC36_LENGTH                             0x1
#define _AT1CC3L_AT1CC36_MASK                               0x40
#define _AT1CC3L_AT1CC37_POSN                               0x7
#define _AT1CC3L_AT1CC37_POSITION                           0x7
#define _AT1CC3L_AT1CC37_SIZE                               0x1
#define _AT1CC3L_AT1CC37_LENGTH                             0x1
#define _AT1CC3L_AT1CC37_MASK                               0x80
#define _AT1CC3L_CC30_POSN                                  0x0
#define _AT1CC3L_CC30_POSITION                              0x0
#define _AT1CC3L_CC30_SIZE                                  0x1
#define _AT1CC3L_CC30_LENGTH                                0x1
#define _AT1CC3L_CC30_MASK                                  0x1
#define _AT1CC3L_CC31_POSN                                  0x1
#define _AT1CC3L_CC31_POSITION                              0x1
#define _AT1CC3L_CC31_SIZE                                  0x1
#define _AT1CC3L_CC31_LENGTH                                0x1
#define _AT1CC3L_CC31_MASK                                  0x2
#define _AT1CC3L_CC32_POSN                                  0x2
#define _AT1CC3L_CC32_POSITION                              0x2
#define _AT1CC3L_CC32_SIZE                                  0x1
#define _AT1CC3L_CC32_LENGTH                                0x1
#define _AT1CC3L_CC32_MASK                                  0x4
#define _AT1CC3L_CC33_POSN                                  0x3
#define _AT1CC3L_CC33_POSITION                              0x3
#define _AT1CC3L_CC33_SIZE                                  0x1
#define _AT1CC3L_CC33_LENGTH                                0x1
#define _AT1CC3L_CC33_MASK                                  0x8
#define _AT1CC3L_CC34_POSN                                  0x4
#define _AT1CC3L_CC34_POSITION                              0x4
#define _AT1CC3L_CC34_SIZE                                  0x1
#define _AT1CC3L_CC34_LENGTH                                0x1
#define _AT1CC3L_CC34_MASK                                  0x10
#define _AT1CC3L_CC35_POSN                                  0x5
#define _AT1CC3L_CC35_POSITION                              0x5
#define _AT1CC3L_CC35_SIZE                                  0x1
#define _AT1CC3L_CC35_LENGTH                                0x1
#define _AT1CC3L_CC35_MASK                                  0x20
#define _AT1CC3L_CC36_POSN                                  0x6
#define _AT1CC3L_CC36_POSITION                              0x6
#define _AT1CC3L_CC36_SIZE                                  0x1
#define _AT1CC3L_CC36_LENGTH                                0x1
#define _AT1CC3L_CC36_MASK                                  0x40
#define _AT1CC3L_CC37_POSN                                  0x7
#define _AT1CC3L_CC37_POSITION                              0x7
#define _AT1CC3L_CC37_SIZE                                  0x1
#define _AT1CC3L_CC37_LENGTH                                0x1
#define _AT1CC3L_CC37_MASK                                  0x80

